{
  "styles": [{
    "1": [
      "Что такое тестирование?",
      " проверка соответствия между реальным и ожидаемым поведением.",
      "assets/voise/0qUs1.mp3"
    ],
    "2": [
      "В чем заключается цель тестирования?",
      "Повысить вероятность того, что приложение, предназначенное для тестирования, будет работать правильно при любых обстоятельствах. _Повысить вероятность того, что приложение, будет соответствовать всем описанным требованиям. _Предоставление актуальной информации о состоянии продукта на данный момент.",
      "assets/voise/0qUs2.mp3"
    ],
    "3": [
      "Гарантирует ли тестирование отсутствие багов в продукте?",
      "Тестирование может показать наличие дефектов в программе, но не доказать их отсутствие. _Тем не менее, важно составлять тест-кейсы, которые будут находить как можно больше багов. Таким образом, при должном тестовом покрытии, тестирование позволяет снизить вероятность наличия дефектов в программном обеспечении.",
      "assets/voise/0qUs3.mp3",
      "https://vc.ru/life/124461-principy-testirovaniya-primenenie-iskazheniya-i-illyuzii"
    ],
    "4": [
      "Расскажите что такое Тест план? И по какой струкутре вы его выстриваете?",
      "это документ, описывающий весь объем работ по тестированию _Отвечает на вопросы: _ •  Что мы тестируем? _• Когда? _ •  Критерии начала / окончания тестирования. _• Окружение(environment) dev/staging/production? _ • Подходы/техники/инструменты/виды тестирования? _• Браузеры/версии/OS/разрешения экрана? _• Кто? Обязанности? Ресурсы? Обучение? _• Сроки? _• График? _• Стратегия тестирования. _•  Ссылки на документацию. ",
      "assets/voise/0qUs4.mp3"
    ],
    "5": [
      "В чем разница между багом и фичей?",
      "Фичей  называют дополнительную, специально придуманную (и, возможно, неочевидную) опцию программы. «багом» можно назвать любой сбой в работе ПО",
      "assets/voise/0qUs5.mp3"
    ],
    "6": [
      "Как протестировать без ТЗ и спецификации?",
      "Информация разниться в разных источниках!  _Возможно ли тестировать без требований? где-то указывают что нет! Потому что именно они определяют, что должен представлять собой тот или иной продукт, и без них он фактически не может быть создан! _    но а как же Ad-hoc testing который не подразумевает никакой подготовки или планирования, здесь нет тестовых сценариев, как и какого-либо ожидания от результата. _ _Нет нужды разрабатывать и придерживаться какого-либо плана, или вести документацию, нет никаких тест-кейсов (правда, от этого могут возникнуть трудности с тем, чтобы воспроизвести ошибку – никаких планов и документов то нет)_   _Преимущества ad-hoc testing _      • Все работает максимально быстро, нет надобности выполнять подготовку. _      • Основные и самые критичные баги находятся сразу же. _      • Новый тестер с таким подходом сможет легко и быстро освоить основные моменты, гораздо быстрее, чем в случае тест-кейсов.   _   Недостатки _ _      • Нет системного подхода, а значит вероятность обнаружения багов ниже, чем при спланированном подходе. _      • Нет системного подхода, а значит вероятность обнаружения багов ниже, чем при спланированном подходе. _      • Очень сложно воспроизвести условия возникновения бага. _      • Обязательно нужны общие знания о продукте, без них такое тестирование невозможно. _ • Сложно планировать ресурсы для тестирования, ведь непонятно, сколько времени и людей нужно, чтобы провести тесты. _ _Однако в любом случае необходимо понимать, кто будет пользоваться продуктом, как он должен выглядеть, из чего состоять и какими обладать функциями. Несмотря на то что эта информация не содержится в спецификациях, в ней как раз и заключены требования к ПО._ _Их источником служат не составленные по всей форме документы, а знания вашей команды, имеющиеся у заказчика представления, короткие разговоры за обедом, общепринятая практика, нормативно-правовые акты, то есть всё то, что порождает так называемые неявные требования ",
      "assets/voise/0qUs6.mp3"
    ],
    "7": [
      "Вы нашли баг, но разработчик говорит, что это фича. Что будете делать?",
      "Изначально перед отправкой баг-репорта стоит его обогатить скриншотами, логами или видео для избежания ситуации ответов от разраба <у меня все работает!> _В дальнейшем при дискуссии стоит проанализировать данные, на которые опирается разработчик, уточнить об актуальности данной информации и дальше выстроить диалог, основываясь от полученной информации.",
      "assets/voise/0qUs7.mp3"
    ],
    "8": [
      "Что такое неявные требования?",
      "Информацию о необходимом поведении, внешнем виде и свойствах системы, не внесенную в ТЗ и спецификации, а также не включенную в постановку задач, относят к неявным требованиям. Они могут проистекать из незадокументированных запросов от заказчика, законодательных актов и стандартов, устных договоренностей между членами команды разработчиков и даже их личного профессионального опыта. _ _      В число инструментов, призванных дополнить и структурировать существующую информацию о программном продукте, входит реестр неявных требований. Он представляет собой список всех связанных с системой фактов и ограничений, которые по какой-то причине не собраны в спецификацию.  __    Этот инструмент пригодится не только в тех случаях, когда техническая документация полностью отсутствует, но и в качестве дополнительного источника информации при наличии спецификаций. _     Такой документ создается в три этапа, подразумевающих формирование следующих перечней: _    • Реестр потенциальных источников неявных требований. _    • Реестр источников неявных требований к проекту. _    • Реестр неявных требований.",
      "assets/voise/0qUs8.mp3",
      "https://software-testing.ru/library/around-testing/requirements/3567-requirements"
    ],
    "9": [
      "Из чего состоит процесс тестирования?",
      " 1) Анализ продукта _ 2) Работа с требованиями _ 3) Разработка тест-плана _ 4) Создание тестовой документации _5) Тестирование прототипа _ 6) Основное тестирование _7) Стабилизация _ 8) Эксплуатация",
      "assets/voise/0qUs9.mp3"
    ],
    "10": [
      "Что такое Качество ПО",
      "Это совокупность характеристик программного обеспечения, относящихся к его способности удовлетворять установленные и предполагаемые потребности.",
      "assets/voise/0qUs10.mp3"
    ],
    "11": [
      "На каких этапах разработки ПО может проходить тестирование?",
      "В жизненном цикле ПО процесс тестирования в основном стоит за этапом разработки, перед эксплуатацией продукта пользователями. _ _Но все зависит от модели разработки и подходов к тестрованию, есть подход left shift test (Тестирование со сдвигом влево) — это подход при котором тестирование выполняется на более ранних этапах жизненного цикла.",
      "assets/voise/0qUs11.mp3"
    ],
    "12": [
      "Что такое тестовое покрытие?",
      "Тестовое покрытие — это плотность покрытия тестами выполняемого ПО или требований к нему. _Чем больше проверок будет создано, тем высшего уровня достигнет тестовое покрытие на любом проекте, стоит еще учитываь о качестве данных проверок. _ _Но, стоит понимать, что до полного покрытия дойти не выйдет, поскольку протестировать все 100% никогда не получится! _Оценка тестового покрытия содержит сразу несколько методологических подходов, а именно: _     • Покрытие требований; _    • Покрытие программного кода; ",
      "assets/voise/0qUs12.mp3",
      "https://testmatick.com/ru/ponyatie-testovogo-pokrytiya/"
      
    ],
    "13": [
      "Как вы узнаете, было ли создано достаточно тестов для тестирования продукта?",
      "во многих источниках указанно что нужно опираться на несколько показателей _ _ • Все 100% требований учтены. _  • Ожидаемое число дефектов обнаружено. _  •  Все дефекты, относящиеся к классу Show Stopper или Blocker, устранены, ни у одного из критических дефектов нет статуса «открытый». _   • Все дефекты с высоким приоритетом идентифицированы и исправлены. _   • Defect Rate (скорость дефектообразования) ниже установленного допустимого уровня. _  • Очень небольшое число дефектов среднего уровня критичности «открыты», их разбор проведен. _  • Число «открытых» дефектов среднего уровня, которые не влияют на пользование системой, очень небольшое. _   • Все дефекты с высоким уровнем приоритета закрыты и соответствующие регрессивные сценарии успешно проведены. _ _ Самый лучшиий вариант это построить матрицу соответствия требований, можно в виде таблицы или чек листа в котором можно отследить стадию завершения тесирования! _Самые частые критерии это _   _ • Время — В ходе тестирования могут находиться баги с разным приоритетом серьезности, попадаются баги блокеры, которые блокируют дальнейшее прохождение по тест кейсам, время на исправление и перепроверку багов может затянуться. _  _ • Бюджет — очень популярно на биржах фриланса, когда оплачиваются найденные баги в зависимости от количества и серьезности или оплачивается по количеству пройденных тест кейсов, также выделяется бюджет на написание самих тесткейсов. _  _  • Все тест кейсы пройдены, найденные баги исправлены и перепроверены — Для того чтобы протестировать приложение, тестировщик для начала должен ознакомиться с требованиями, функциональными спецификациями к приложению, если они конечно есть, или узнать со слов заказчика какое поведение должно быть при разных сценариях использования приложения или фитчи.",
      "assets/voise/0qUs13.mp3"
    ],
    "14": [
      "Если нашли незначительную ошибку и рядом сидит разработчик и может ее быстро исправить, будете документировать или напрямую скажете разработчику исправь ее?",
      "Ошибку лучше зафиксировать в баг-трекинговой системе для дальнейшего отслеживания! _ При необхадимости информацию о данной ошибке при исправлении которой может сломаться другой функционал найдут и выстроят правиьную цепочку собыитий",
      "assets/voise/0qUs14.mp3"
    ],
    "15": [
      "Что такое спецификация ПО?",
      "Спецификация (specifications) — это технический документ, который описывает функции и поведение приложения._ _Помогает получить четкое представление о продукте для его разработки и минимизировать сбои программного обеспечения _Спецификация — это документ с проанализированными требованиями",
      "assets/voise/0qUs15.mp3",
      "https://raznisa.ru/raznica-mezhdu-trebovaniyami-i-specifikaciej-v-razrabotke-programmnogo-obespecheniya/"
    ],
    "16": [
      "Чем отличается Валидация от Верификации",
      "Верификация (verification)— оценка соответствия продукта требованиям (спецификации). _Отвечает на вопрос: “Система работает в соответствии с требованиями?”__Валидация (validation)— оценка соответствия продукта ожиданиям и требованиям пользователей. _Отвечает на вопрос: “Требования удовлетворяют ожидания пользователя?”",
      "assets/voise/0qUs16.mp3"
    ],
    "17": [
      "Какие основные Уровни Тестирования вы знаете?",
      "1. Модульное тестирование (Unit Testing) Тестирование объектов, классов, функций и т.д., обычно выполняемое программистами. _ _2. Интеграционное тестирование (Integration Testing)- Тестирование взаимодействия между классами, функциями, модулями. Например интеграция система оплаты проезда в метро с помощью банковской карты._ _3. Системное тестирование (System Testing) - Проверка как функциональных, так и не функциональных требований в системе._ _4. Приемочное тестирование (Acceptance Testing)Проверка соответствия системы требованиям и проводится с целью определения: _ удовлетворяет ли система приемочным критериям; _в итоге приниматеся решения заказчиком или менеджером принимать приложение или нет.",
      "assets/voise/0qUs17.mp3"
    ],
    "18": [
      "что такое Операционное тестирование",
      "Даже если система удовлетворяет всем требованиям, важно убедиться в том, что она удовлетворяет нуждам пользователя и выполняет свою роль в среде своей эксплуатации, как это было определено в бизнес моделе системы. __Следует учесть, что и бизнес модель может содержать ошибки. Поэтому так важно провести операционное тестирование как финальный шаг валидации. __ Кроме этого, тестирование в среде эксплуатации позволяет выявить и нефункциональные проблемы, такие как: конфликт с другими системами, смежными в области бизнеса или в программных и электронных окружениях; недостаточная производительность системы в среде эксплуатации и др. __ Очевидно, что нахождение подобных вещей на стадии внедрения — критичная и дорогостоящая проблема. Поэтому так важно проведение не только верификации, но и валидации, с самых ранних этапов разработки ПО.",
      "assets/voise/0qUs18.mp3"
    ],
    "19": [
      "Чем отличается sanity от smoke тестирования?",
      "В отличии от дымового (Smoke testing), санитарное тестирование (Sanity testing) направлено вглубь проверяемой функции, в то время как дымовое направлено вширь, для покрытия тестами как можно большего функционала в кратчайшие сроки.",
      "assets/voise/0qUs19.mp3"
    ],
    "20": [
      "Как тестировщик может понять, что баг исправлен?",
      "пройти тест кейс повторно, сделать retest",
      "assets/voise/0qUs20.mp3"
    ],
    "21": [
      "Чем отличается тестирование черного ящика от тестирования белого ящика?",
      "В тестировании черного ящика мы находимся в тех же условиях что и пользователи, не имея документации или любой другой информации как часть команд разработки, в тестировании белого ящика у нас есть доступ ко всем возможным аспектам и ветвя разработки ПО",
      "assets/voise/0qUs21.mp3"
    ],
    "22": [
      "Что такое тест-дизайн и для чего он нужен?",
      "Это этап процесса тестирования ПО, на котором проектируются и создаются тестовые случаи (тест кейсы), в соответствии с определёнными ранее критериями качества и целями тестирования. Роли, ответственные за тест дизайн: • Тест аналитик — определяет «ЧТО тестировать?» • Тест дизайнер — определяет «КАК тестировать?»",
      "assets/voise/0qUs22.mp3"
    ],
    "23": [
      "Что такое обеспечение качества (QA) и Что такое контроль качества (QC)?!",
      "Контроль качества (Quality Control) – это совокупность действий, проводимых над продуктом в процессе разработки, для получения информации о его актуальном состоянии в разрезах: «готовность продукта к выпуску», «соответствие зафиксированным требованиям», «соответствие заявленному уровню качества продукта». _Обеспечение качества (Quality Assurance) - это совокупность мероприятий, охватывающих все технологические этапы разработки, выпуска и эксплуатации программного обеспечения (ПО) информационных систем, предпринимаемых на разных стадиях жизненного цикла ПО, для обеспечения требуемого уровня качества выпускаемого продукта.    ",
      "assets/voise/0qUs23.mp3"
    ],
    "24": [
      "Что такое модель зрелости тестирования",
      "TMM основан на модели зрелости возможностей (CMM — Capability Maturity Model). Это подробная модель для улучшения процесса тестирования. Она может быть дополнена любой моделью улучшения процесса или может использоваться как одиночная модель. Модель ТММ имеет два основных компонента: _ _Набор из 5 уровней, которые определяют возможности тестирования (testing capability) Модель оценки (An Assessment Model) Пять уровней TMM помогают организации определить зрелость своего процесса и определить следующие шаги по улучшению, которые необходимы для достижения более высокого уровня зрелости тестирования. _ _Уровень 1. Начальный. ПО должно успешно работать На этом уровне области процессов не определены Цель тестирования — убедиться, что ПО работает нормальноНа этом уровне не хватает ресурсов, инструментов и обученного персонала.Нет проверки качества перед поставкой ПО _ _Уровень 2. Определенный. Разработка целей и политик тестирования и отладки.Этот уровень отличает тестирование от отладки, и они считаются различными действиями Этап тестирования наступает после кодирования Основная цель тестирования — показать, что ПО соответствует спецификации.Основные методы и методики тестирования _ _Уровень 3: Комплексный. Интеграция тестирования в жизненный цикл ПО. Тестирование интегрируется в весь жизненный цикл. На основании требований определяются цели испытаний Структура тестирования существует Тестирование на уровне профессиональной деятельности _ _Уровень 4: Управление и измерение. Создание программы тестовых измерений. Тестирование — это измеренный и количественный процесс Проверка на всех этапах разработки признается как тестирование Для повторного использования и регрессионного тестирования есть Test case и они записаны в базу тестов. Дефекты регистрируются и получают уровни серьезности _ _Уровень 5: Оптимизированный. Оптимизация процесса тестирования.Тестирование управляется и определено Эффективность и стоимость тестирования можно отслеживать Тестирование может постоянно настраиваться и улучшаться Практика контроля качества и предотвращения дефектов Практикуется процесс повторного использования (Reuse) Метрики, связанные с тестированием, также имеют средства поддержки Инструменты обеспечивают поддержку разработки тестовых наборов и сбора дефектов",
      "assets/voise/0qUs24.mp3"
    ],
    "25": [
      "Какие Принципы тестирования вы знаете ?",
      "1. Тестирование демонстрирует наличие дефектов: _ _Тестирование может показать, что дефекты присутствуют, но не может доказать, что их нет _ _2. Исчерпывающее тестирование недостижимо: _Полное тестирование с использованием всех комбинаций вводов и предусловий физически невыполнимо, за исключением тривиальных случаев._ _3. Раннее тестирование: _Чтобы найти дефекты как можно раньше, активности по тестированию должны быть начаты как можно раньше в жизненном цикле разработки. _ _4. Скопление дефектов: _Как правило, большая часть дефектов, обнаруженных при тестировании, содержится в небольшом количестве модулей. _ _5. Парадокс пестицида: _Если одни и те же тесты будут прогоняться много раз, в конечном счете этот набор тестовых сценариев больше не будет находить новых дефектов. _ _6. Тестирование зависит от контекста: _Тестирование выполняется по-разному в зависимости от контекста. _ _7. Заблуждение об отсутствии ошибок: _Обнаружение и исправление дефектов не помогут, если созданная система не подходит пользователю и не удовлетворяет его ожиданиям и потребностям.",
      "assets/voise/0qUs25.mp3"
    ],
    "26": [
      "Чем отличается тест-кейс от баг-репорта?",
      "В баг репорте пишется фактический результат а в тест кейсе нет!",
      "assets/voise/0qUs26.mp3"
    ],
    "27": [
      "расскажите про градацию Severity (Серьезность)?",
      " • Блокирующая (Blocker) - Блокирующая ошибка, приводящая приложение в нерабочее состояние, в результате которого дальнейшая работа с тестируемой системой или ее ключевыми функциями становится невозможна. Решение проблемы необходимо для дальнейшего функционирования системы. _ _• Критическая (Critical) -Критическая ошибка, неправильно работающая ключевая бизнес логика, дыра в системе безопасности, проблема, приведшая к временному падению сервера или приводящая в нерабочее состояние некоторую часть системы, без возможности решения проблемы, используя другие входные точки. __ • Значительная (Major) -Значительная ошибка, часть основной бизнес логики работает некорректно. Ошибка не критична или есть возможность для работы с тестируемой функцией, используя другие входные точки. __ • Незначительная (Minor) - Незначительная ошибка, не нарушающая бизнес логику тестируемой части приложения, очевидная проблема пользовательского интерфейса. _ _• Тривиальная (Trivial) - Тривиальная ошибка, не касающаяся бизнес логики приложения, плохо воспроизводимая проблема, малозаметная посредствам пользовательского интерфейса, проблема сторонних библиотек или сервисов, проблема, не оказывающая никакого влияния на общее качество продукта.",
      "assets/voise/0qUs27.mp3"
    ],
    "28": [
      "что такое Фокус-тест",
      "Тестирование, проводимое с целью получения первичной реакции игроков. Необходимо для оценки удобства использования и того, как продукт принимается целевой аудиторией или сторонними людьми.",
      "assets/voise/0qUs28.mp3"
    ],
    "29": [
      "Чем отличается тест-кейс от чек-листа?",
      "Если коротко, то Чек- лист — это просто список того, что нужно проверить. __Не коротко Тест-кейс — подборный план того, как именно мы будем это проверять, чек-лист это документ, описывающий что должно быть протестировано. _При этом чек-лист может быть абсолютно разного уровня детализации. __На сколько детальным будет чек-лист зависит от требований к отчетности, уровня знания продукта сотрудниками и сложности продукта. Чек-лист менее формализован чем тест-кейс. .",
      "assets/voise/0qUs29.mp3"
    ],
    "30": [
      "дайте определения тест-кейса! Какие основные поля содержит тест-кейс? Без чего текст-кейсы уже не будет тест-кейсом? речь об основных полях .",
      "Test Case — это документ, описывающий совокупность шагов, конкретных условий и параметров, необходимых для проверки тестируемой функции. _ _Тест кейс состоит из: _ID (идентификатор) _Title (название) _Type (тип) _Priority (приоритет) _Preconditions (предусловия) _Steps (шаги) _Expected Result (ожидаемый результат) _Post conditions (пост условия) - например очистка данных или возвращение системы в первоначальное состояние. _ Тест кейс без шагов и заголовка уже не тест-кейс",
      "assets/voise/0qUs30.mp3"
    ],
    "31": [
      "Всегда ли нужны тест-кейсы? Обращу внимание, что тут нужно перечислить случае, в которых они не нужны.",
      "Обычно при работе с простыми системами — сайтами, мобильными приложениями и т. д. — нет необходимости в тест-кейсах. _ Часто в команде бывает только один-два тестировщика, которые хорошо знают свой продукт. В таком случае время, потраченное на создание и поддержку тест-кейсов, никогда не окупится. Лучше создать чеклист со списком функций, которые нужно проверить — это будет более рационально.",
      "assets/voise/0qUs31.mp3"
    ],
    "32": [
      "что такое Требования и по каким принципам нужно проверять Требования ?",
      "  Требования - это спецификация (описание) того, что должно быть реализовано. _Требования описывают то, что необходимо реализовать, без детализации технической стороны решения. Что, а не как. _ _Требования к требованиям: _1) Корректность _2) Недвусмысленность _3) Полнота _4) Непротиворечивость _5) Упорядоченность по важности и стабильности _6) Проверяемость (тестопригодность) _7) Модифицируемость _8)  Трассируемость _9) Понимаемость",
      "assets/voise/0qUs32.mp3"
    ],
    "33": [
      "Классы эквивалентности используются только вместе с граничными значениями или можно применить их отдельно?",
      "Бывают ситуаци когда с классом эквивалентности нельзя применить граничные значение _ _Пример: есть опции у машин:  _<зимнего пакета>_   Подогрев сидений. _   Подогрев руля. _    Подогрев лобового и заднего стекла. _    Подогрев форсунок стеклоомывателя _    Подогрев боковых зеркал. _ _<электронные помощники> _Парктроник _Передние и задние датчики системы ParkPilot _контроль слепых зон _ и т.д. _Это две классы эквивалентности но о каких граничных значениях может итди речь ? Пример придумал я по этому :3",
      "assets/voise/0qUs33.mp3"
    ],
    "34": [
      "Тебе пришла задача в тестирование. Как будешь оценивать время на проверку?",
      "Слишком размытая формулировака есть только перечень действий для такой ситауции отталкиваться от количества тестовых сценариев.Я предпочитаю рассчитывать именно так.__1) Оцениваем объемы задачи. _ _2) Прикидываем примерное количество-кейсов (проверок) на данную задачу. _ _3) Умножаем кол-во на примерное среднее время прохождение кейсов (для веба это в районе 4х минут, дальше зависит от специфики отрасли). _ _4) Закладываем риски в 0.66 от оценки",
      "assets/voise/0qUs34.mp3"
    ],
    "35": [
      "раскажите про Жизненный цикл бага",
      "1) Баг создан_2) Назначен на разработчика _3) Приоритизирован _4) Взят в работу _5) Исправлен _6) Тестируется (retest) - если не исправлен то в обратно в пункт 2 _7) Закрыт",
      "assets/voise/0qUs35.mp3"
    ],
    "36": [
      "Как вы будете тестировать карандаш/чайник/чашку/лифт…?",
      "С таким вопросами только на ...",
      "assets/voise/0qUs36.mp3"
    ],
    "37": [
      "Что такое тест кейс?",
      "это артефакт, описывающий совокупность шагов, конкретных условий и параметров, необходимых для проверки реализации тестируемой функции или её части.",
      "assets/voise/0qUs37.mp3"
    ],
    "38": [
      "Что такое тестирование API?",
      "Тестирование API — это тип тестирования программного обеспечения, при котором анализируется интерфейс прикладной программы (API), чтобы убедиться, что он соответствует ожидаемой функциональности, безопасности, производительности и надежности. Тесты выполняются непосредственно в API и в рамках интеграционного тестирования. _ _При тестировании API фокусируются на анализе бизнес-логики, а также безопасности откликов приложений и данных. _ _Тест API обычно выполняется путем отправки запросов к одной или нескольким конечным точкам API и сравнения ответа с ожидаемыми результатами. _ _Тестирование API считается критически важным для автоматизации тестирования, потому что API — основной интерфейс логики приложения, и поскольку тесты GUI трудно поддерживать с короткими циклами выпуска и частыми изменениями при гибкой разработке программного обеспечения и использовании подходов DevOp",
      "assets/voise/0qUs38.mp3"
    ],
    "39": [
      "Приведите примеры интеграции через API.",
      "системы бронирования билетов, например, Aviasales. Пользователи ожидают, что самые дешевые варианты перелетов на определенные даты будут доступны и показаны им по запросу. Это требует, чтобы приложение связывалось со всеми авиакомпаниями, чтобы найти наилучшие варианты перелета — это делается через API. _   _ В данном случае необходимо выполнить тесты API, чтобы убедиться, что система бронирования билетов успешно взаимодействует с другими компаниями и предоставляет пользователям правильные результаты в соответствующие сроки. Кроме того, если пользователь бронирует рейс и оплачивает его с помощью стороннего платежного сервиса, то должны быть выполнены тесты API, чтобы гарантировать, что платежный сервис и системы бронирования путешествий могут эффективно взаимодействовать, обрабатывать платеж и сохранять конфиденциальные данные пользователя в безопасности.",
      "assets/voise/0qUs39.mp3",
      "https://logrocon.ru/news/api_testing"
      
    ],
    "40": [
      "В чем разница между SOAP и REST?",
      "REST и SOAP на самом деле не сопоставимы. REST — это архитектурный стиль. SOAP — это формат обмена сообщениями. _Есть сылка чтобы изучить подробннее",
      "assets/voise/0qUs40.mp3",
      "https://habr.com/ru/post/483204/"
    ],
    "41": [
      "Перечислите ключевые элементы HTTP-запроса! У метода Get есть тело запроса ? ",
      "url, _методы,_загаловки запроса, _тело запроса ! _ _GET-запросы могут иметь тело!. Большинство реализаций проигнорируют его или отклонят запрос. Но даже если сервер, предоставляющий ваш API, разрешает тело, вы не можете его использовать браузеры его отклонят",
      "assets/voise/0qUs41.mp3"
    ],
    "42": [
      "Может ли у ПО быть сразу несколько баз данных?",
      "Если вопрос в возможности то да может, но возникнут проблемы с оптимизацией",
      "assets/voise/0qUs42.mp3"
    ],
    "43": [
      "Что такое реляционная база данных?",
      "Реляционные базы данных представляют собой базы данных, которые используются для хранения и предоставления доступа к взаимосвязанным элементам информации. _Реляционные базы данных основаны на реляционной модели — интуитивно понятном, наглядном табличном способе представления данных. _Каждая строка, содержащая в таблице такой базы данных, представляет собой запись с уникальным идентификатором, который называют ключом. Столбцы таблицы имеют атрибуты данных, а каждая запись обычно содержит значение для каждого атрибута, что дает возможность легко устанавливать взаимосвязь между элементами данных.",
      "assets/voise/0qUs43.mp3"
    ],
    "44": [
      "Приведите несколько примеров, которые объясняют критерии входа для тестирования ПО.",
      "• все дефекты, которые относятся к ранним стадиям проектирования закрыты и проверены;_   • Код проверенный с помощью осуществления «Unit» тестов;_   • Основные функциональные возможности ПО готовы для тестирования;_  • Имеется документация, которая определяет требования;_   • Все тестировщики ознакомлены с архитектурой ПО;_    • Все тестировщики ознакомлены с целями проекта; _   • Готова среда тестирования;_доступные для использования билды;_   • Утверждены план тестирования и/или тестовые случаи.",
      "assets/voise/0qUs44.mp3"
    ],
    "45": [
      "Всегда ли нужна автоматизация?",
      "Автотесты не являются подходящей альтернативой: _    • если сценарии тестов новые и не тестировались вручную _   • если тесты требуют постоянных изменений и в случае _    • если запустить сценарий тестирования нужно только один раз.",
      "assets/voise/0qUs45.mp3"
    ],
    "46": [
      "Приведите несколько причин, которые приводят к багам в ПО.",
      "человеческие ошибки (процесс проектирования и процесс реализации); _изменение требований в то время как ПО под испытанием; _непонимание требований и спецификаций;_отсутствие времени;_плохая приоритизация тестирования;_плохая ориентация в версиях ПО;_сложность самого ПО.",
      "assets/voise/0qUs46.mp3"
    ],
    "47": [
      "чем отличаются между собой дефект,эрор, Баг и сбой ",
      " _ • Дефект (он же баг)— это несоответствие фактического результата ожидаемому результату, описанному в требованиях. _ _• Error— ошибка пользователя, то есть он пытается использовать программу иным способом. _Пример — вводит буквы в поля, где требуется вводить цифры (возраст, количество товара и т.п.). _ _• Bug (defect) — ошибка программиста (или другого члена команды), то есть когда в программе, что-то идёт не так как планировалось и программа выходит из-под контроля. _      Например, когда никак не контролируется ввод пользователя, в результате неверные данные вызывают краши или иные проблемы в работе программы. Либо внутри программа построена так, что изначально не соответствует тому, что от неё ожидается. _ _• Failure — сбой (причём необязательно аппаратный) в работе компонента, всей программы или системы. _То есть, существуют такие дефекты, которые приводят к сбоям. И существуют такие, которые не приводят. UI-дефекты например. Но аппаратный сбой, никак не связанный с software, тоже является failure.  ",
      "assets/voise/0qUs47.mp3"
    ],
    "48": [
      "Тестирование локализации",
      "тестирование, направленное на проверку корректности и качества адаптации продукта к использованию на том или ином языке с учётом национальных и культурных особенностей.",
      "assets/voise/0qUs48.mp3"
    ],
    "49": [
      "Почему вы решили стать тестировщиком?",
      "Если бы ты жил в Китае и задвал бы такие же вопросы,тебя бы звали Кон-Чен-Ый",
      "assets/voise/0qUs49.mp3"
    ],
    "50": [
      "Почему хотите работать именно у нас?",
      "",
      "assets/voise/0qUs50.mp3"
    ],
    "51": [
      "Кем вы видите себя через 5 лет?",
      "профессионалом своего дела среди единомышленников",
      "assets/voise/0qUs51.mp3"
    ],
    "52": [
      "Что такое тестирование серого ящика?",
      "Тестирование серого ящика предусматривает частичную осведомленность о внутренних процессах. __ Данный метод - это комбинация тестирования белого и черного ящиков. Специалист стремится найти все проблемы функционирования и ошибки в коде. На этой стадии тестировщик может реализовать сквозной тест.",
      "assets/voise/0qUs52.mp3"
    ],
    "53": [
      "что такое Позитивное тестирование?",
      "Позитивное тестирование помогает убедиться в том, что приложение функционирует должным образом и позволяет проверить, работает ли система в нормальных условиях так, как задумывалось",
      "assets/voise/0qUs53.mp3"
    ],
    "54": [
      "что такое Негативное тестирование?",
      " это тип тестирования ПО, направленный на проверку того, что система или приложение ведут себя должным образом в негативных ситуациях, то есть, когда они получают недопустимые или неожиданные входные данные.",
      "assets/voise/0qUs54.mp3"
    ],
    "55": [
      "зачем проводят Повторное тестирование ?",
      "Чтобы проверить, что тестовые сценарии, не прошедшие во время последнего прогона тестов, работают после исправления дефектов",
      "assets/voise/0qUs55.mp3"
    ],
    "56": [
      "что такое сравнительное тестирование?",
      "тестирование, направленное на сравнительный анализ преимуществ и недостатков разрабатываемого продукта по отношению к его основным конкурентам.",
      "assets/voise/0qUs56.mp3"
    ],
    "57": [
      "что такое UX и UI ? в чем их разница",
      "(  User eXperience — опыт пользователя — ощущение, испытываемое пользователем во время использования цифрового продукта. _ User Interface — пользовательский интерфейс — это инструмент, позволяющий осуществлять взаимодействие «пользователь — приложение».",
      "assets/voise/0qUs57.mp3"
    ],
    "58": [
      "что такое Дымовое тестирование?",
      "короткий цикл тестов для подтверждения, что после сборки кода (нового или исправленного) приложение стартует и выполняет основные функции.",
      "assets/voise/0qUs58.mp3"
    ],
    "59": [
      "Чем отличается Exploratory vs Ad-hoc testing ?",
      "Исследовательское тестирование (exploratory testing) - это одновременное изучение системы, проектирование тестов (тест дизайн) и тестирование. _ Данная техника базируется на опыте тестировщика (experience based). _Ad-hoc тестирование - это особый вид тестирования, не предполагающий никакой подготовки или планирования, здесь нет тестовых сценариев, как и какого-либо ожидания от результата. ",
      "assets/voise/0qUs59.mp3",
      "https://www.careerist.com/ru-insights/intuitivnoe-testirovanie-ad-hoc-testing#:~:text=%D0%A7%D1%82%D0%BE%20%D1%8D%D1%82%D0%BE%20%D1%82%D0%B0%D0%BA%D0%BE%D0%B5%2C%20%D0%BA%D0%B0%D0%BA%D0%B8%D0%B5%20%D0%B5%D1%81%D1%82%D1%8C,%D0%BA%D0%B0%D0%BA%D0%BE%D0%B3%D0%BE%2D%D0%BB%D0%B8%D0%B1%D0%BE%20%D0%BE%D0%B6%D0%B8%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F%20%D0%BE%D1%82%20%D1%80%D0%B5%D0%B7%D1%83%D0%BB%D1%8C%D1%82%D0%B0%D1%82%D0%B0."
    ]
  },
    {
      "1": [
        "Что такое тестирование?",
        " (тестирование ПО) - является одной из техник контроля качества и включает в себя активности:_по планированию работ(Test Management),_проектированию тестов(Test Design), _выполнению тестирования (Test Execution) _ анализу полученных результатов (Test Analysis).",
        "assets/voise/0qUs1.mp3"
      ],
      "2": [
        "Зачем тестировать ПО?",
        "1)Это повысит вероятность того, что приложение: _ • будет соответствовать всем описанным требованиям. _ • будет работать правильно при любых обстоятельствах. _2) И это предоставит актуальную информации о состоянии продукта на данный момент.",
        "assets/voise/1qUs2.mp3"
      ],
      "3": [
        "Какие существуют этапы тестирования?",
        "_1. Анализ продукта _2. Работа с требованиями _3. Разработка стратегии тестирования и планирование процедур контроля качества _4. Создание тестовой документации _5. Тестирование прототипа _6. Основное тестирование _7. Стабилизация _8. Эксплуатация",
        "assets/voise/1qUs3.mp3"
      ],
      "4": [
        "Что такое статическое и динамическое тестирование?",
        "Статическое тестирование отличается от динамического тем, что производится без запуска программного кода продукта. Тестирование осуществляется путем анализа программного кода (code review) или скомпилированного кода.",
        "assets/voise/1qUs4.mp3"
      ],
      "5": [
        "Какие уровни тестирования знаете?",
        "1. Модульное тестирование (Unit Testing) _2. Интеграционное тестирование (Integration Testing) _3. Системное тестирование (System Testing) _4. Операционное тестирование (Release Testing) _5. Приемочное тестирование (Acceptance Testing)",
        "assets/voise/1qUs5.mp3"
      ],
      "6": [
        "Какие техники тест-дизайна знаете?",
        "1. Эквивалентное разделение (Equivalence Partitioning — EP) _2. Анализ граничных значений (Boundary Value Analysis - BVA) _3. Причина / Следствие (Cause / Effect - CE) _4. Предугадывание ошибки (Error Guessing - EG) _5. Исчерпывающее тестирование (Exhaustive Testing - ET) _6.Диаграмма (граф) состояний-переходов (State Transition diagram) _7. Пользовательский сценарий (Use case) _8 Попарное тестирование (Pairwise Testing)",
        "assets/voise/1qUs6.mp3"
      ],
      "7": [
        "Что такое техника анализа классов эквивалентности?",
        "это разделение диапазона возможных вводимых значений на группы эквивалентных по своему влиянию на систему. Эта техника помогает не только сокращать количество тестов, но и сохранять приемлемое тестовое покрытие.",
        "assets/voise/1qUs7.mp3"
      ],
      "8": [
        "Что такое техника анализа граничных значений? В чем ценность этой техники?",
        " значения диапазона входных данных, при которых меняется поведение приложения. Это соседние значения диапазона, но относящиеся к разным эквивалентным классам.",
        "assets/voise/1qUs8.mp3"
      ],
      "9": [
        "Что такое Регрессионное и Confirmation (Подтверждающее ) тестирование, какая между ними разница?",
        "Проводится регрессионное тестирование AUT тогда, когда нужно убедиться что новые (добавленные) функции приложения / исправленные дефекты не оказали влияния на текущую, уже существующую функциональность, работавшую (и протестированную) ранее. _Подтверждающее тестирование (Confirmation Testing) Тестирование, при котором выполняются тестовые сценарии, которые были не пройдены при последнем запуске, с целью подтвердить успешность исправлений. (retest)",
        "assets/voise/1qUs9.mp3"
      ],
      "10": [
        "Что такое Верификация? и Что такое Валидация?",
        " Верификация - процесс оценки соответствия продукта явным требованиям (спецификациям). _Валидация Оценка соответствия продукта ожиданиям и требованиям пользователей.",
        "assets/voise/1qUs10.mp3"
      ],
      "11": [
        "Расскажите про жизненный цикл разработки ПО",
        "1) Идея  _2) Сбор и анализ требований  _3) Документирование требований  _4) Дизайн  _5)Разработка _6) Тестирование _7) Внедрение/развертывание _8) Поддержка (Maintenance) ",
        "assets/voise/1qUs11.mp3"
      ],
      "12": [
        "Что такое Configuration Testing?",
        "конфигурационное тестирование (Configuration Testing) – специальный вид тестирования, направленный на проверку работы программного обеспечения при различных конфигурациях системы (заявленных платформах, поддерживаемых драйверах, при различных конфигурациях компьютеров и т. _Цель Тестирования: определить оптимальную конфигурацию оборудования, обеспечивающую требуемые характеристики производительности и времени реакции тестируемой системы. ",
        "assets/voise/1qUs12.mp3",
        "http://www.protesting.ru/testing/types/configuration.html"
        
      ],
      "13": [
        "Что такое Exploratory Testing?",
        "Это вид тестирования, при котором мы одновременно и тестируем, и придумываем тест, опираясь на поведение продукта _Зачем вообще проводить тест таким способом? Причин может быть несколько: _ • пока еще нет готовых тестов (например, продукт новый); _ • результат нужен побыстрее; _ • хотим подстраховаться — проверить и готовыми тестами, и новыми. _4 характеристики исследовательского тестирования _ 1) Параллельное планирование, создание и выполнение в процессе работы. 2) Гибкость в тестировании — тест без определенного сценария. 3) Возможность отклонения от сценария  в любом направлении. _4)Высокая скорость начала тестирования (начинаем тестировать сразу, как получаем задачу — план составлять не нужно).",
        "assets/voise/1qUs13.mp3","https://qaschool.ru/blog/issledovatelskoe-testirovanie-osnovnye-harakteristiki-tipy-i-otlichiya-ot-skriptovogo/#:~:text=%D0%A7%D1%82%D0%BE%20%D0%B6%D0%B5%20%D1%82%D0%B0%D0%BA%D0%BE%D0%B5%20%D0%B8%D1%81%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D0%BA%D0%BE%D0%B5%20%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5,%D1%82%D0%B5%D1%81%D1%82%2C%20%D0%BE%D0%BF%D0%B8%D1%80%D0%B0%D1%8F%D1%81%D1%8C%20%D0%BD%D0%B0%20%D0%BF%D0%BE%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BF%D1%80%D0%BE%D0%B4%D1%83%D0%BA%D1%82%D0%B0."
      ],
      "14": [
        "Какие существуют UI-стандарты?",
        "Я предпологаю что речь идет о гайдлайнах _Гайдлайн — это свод правил использования фирменного стиля бренда. _Этот документ необходим, чтобы сохранить единый образ,_ _ Гайдлайн — это руководство по использованию фирменного стиля или по другому то это свод правил использования фирменного стиля бренда. Многие часто путают этот документ с брендбуком. Их основное отличие в том, что в брендбуке, помимо рекомендаций по визуальным атрибутам, содержится ещё и платформа бренда —  философия, ценности, характер и позиционирование ТМ. Другими словами, гайдлайн является частью брендбука. Это внутрикорпоративный документ, полезный дизайнерам, маркетологам, директорам и практически каждому, кто влияет на реализацию визуальной стратегии бренда. _Гайдлайн: _Помогает исключить разрыв бренда. _Упрощает сотрудничество со сторонними агентствами и специалистами._Повышает узнаваемость и сохраняет идентичность ТМ. _Сохраняет визуальный образ при расширении бизнеса по франчайзинговой модели. _Помогает с ребрендингом при сохранении преемственности фирменному стилю. _Гайдлайн — это не просто правила использования фирменного стиля, это целая дизайн-система. Визуальный язык бренда и его техническое отражение в виде макетов, шаблонов, готовых решений в одном документе._Google Material Design для Android - https://m2.material.io/design/guidelines-overview _ Human Interface Guidlines для ios -https://developer.apple.com/design/human-interface-guidelines/guidelines/overview/   __ или тут речь про совсем другое https://habr.com/ru/post/12778/ ",
        "assets/voise/1qUs14.mp3"
      ],
      "15": [
        "Что такое Black/Grey/White Box Testing?",
        "Это методы тестирования которые дают понять насколько глубоко можно погрузить в технические аспекты продукта, доступ к Базе данных, к коду продукта, документации: _черный ящик определяет отсутствие доступа к любой внутренний информации! _Белый ящик предполагает что мы имеем доступ к любой информации продукта, это внутренняя информация которая побудит тестировщика сделать дополнительные проверки зная архитектуру и другие нюансы ПО! _серый ящик трактуется в каждой компании по своему, но в целом это когда есть доступ к данным доступ к которым нет у обычных пользователей, на пример есть доступ к базе данных, это не белый ящик где имеем полный доступ ко всему, но и не черный! ",
        "assets/voise/1qUs15.mp3"
      ],
      "16": [
        "Что такое Performance Testing?",
        "Тестирование производительности - это набор типов тестирования, направленных на воссоздание пользовательских запросов в системе и сравнение ожидаемых результатов с полученными показателями, а также определение скорости процедур, стабильности, надежности и масштабируемости системы в целом. Полученные результаты позволяют обнаруживать уязвимости с пропускной способностью приложения, временем загрузки, обработкой больших объемов данных и предотвращением их использования в приложении. _Эффективность тестирования_Когда вы игнорируете тестирование производительности перед запуском продукта, предприятия теряют большое количество пользователей и вынуждены тратить значительные средства на дальнейшее исправление ошибок. Чтобы избежать рисков приложения, необходимо проверить следующие факторы: _ Время отклика системы _Неожиданные условия нагрузки _Системная масштабируемость _Пользовательские нагрузки Spike _Стабильность системы _Уровень пропускной способности _Оптимизируйте производительность",
        "assets/voise/1qUs16.mp3",
        "https://www.start-it.ua/post/%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-%D0%BF%D1%80%D0%BE%D0%B8%D0%B7%D0%B2%D0%BE%D0%B4%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8-performance-testing-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D1%8B%D0%B5-%D0%BA%D0%BE%D0%BD%D1%86%D0%B5%D0%BF%D1%86%D0%B8%D0%B8"
      ],
      "17": [
        "Какие бывают требования?",
        "Явные и не явные, фукнциональные и не фукнциональные",
        "assets/voise/1qUs17.mp3"
      ],
      "18": [
        "Что такое Traceability Matrix (Матрица соответствия требований)?",
        "Это двумерная таблица, содержащая соответсвие функциональных требований (functional requirements) продукта и подготовленных тестовых сценариев (test cases). В заголовках колонок таблицы расположены требования, а в заголовках строк — тестовые сценарии. На пересечении — отметка, означающая, что требование текущей колонки покрыто тестовым сценарием текущей строки. Матрица соответсвия требований используется QA-инженерами для валидации покрытия продукта тестами. МСТ является неотъемлемой частью тест-плана.",
        "assets/voise/1qUs18.mp3"
      ],
      "19": [
        "Какие виды тестирования связаны с изменениями?",
        "1. Дымовое тестирование (Smoke Testing) _2. Регрессионное тестирование (Regression Testing) _3. Повторное тестирование (Re-testing) _4. Тестирование сборки (Build Verification Testing) _5. Санитарное тестирование (Sanity Testing)",
        "assets/voise/1qUs19.mp3"
      ],
      "20": [
        "Что такое End-to-End тест?",
        "Сквозное тестирование (End-to-end, E2E, Chain testing) — это вид тестирования, используемый для проверки программного обеспечения от начала до конца, а также его интеграцию с внешними интерфейсами. Цель сквозного тестирования состоит в проверке всего программного обеспечения на предмет зависимостей, целостности данных и связи с другими системами, интерфейсами и базами данных для проверки успешного выполнения полного производственного сценария _Наряду с программной системой тестирование также обеспечивает проверку пакетной обработки и обработки данных из других вышестоящих и нижестоящих систем. Отсюда и название «End-to-End». Сквозное тестирование обычно проводится после функционального и системного тестирования. Для его проведения используются реальные данные и тестовая среда для имитации рабочего режима. _Зачем нужно сквозное тестирование? _Сквозное тестирование проверяет весь системный флоу(поток) и повышает уверенность за счет своевременного обнаружения проблем и увеличения покрытия тестами подсистем. Современные системы ПО сложны и взаимосвязаны с большим количеством подсистем, которые могут существенно отличаться от существующих систем. Вся система может разрушиться из-за отказа любой подсистемы, что представляет собой серьезный риск. Этого риска мы как раз и стремимся избежать с помощью сквозного тестирования._Инструмент сквозного тестирования _testRigor _В мире сквозного тестирования лидером отрасли является testRigor. Он помогает создавать тесты без кода для веб-интерфейса, нативных и гибридных мобильных приложений, мобильных браузеров и API. С его помощью можно тестировать электронную почту и SMS, загруженные файлы .XLS, .DOC, .PDF и т. д.  _Сквозное тестирование vs системное тестирование _Сквозное тестирование _1)Проверяет программную систему, а также взаимосвязанные подсистемы. _2) Проверяет весь сквозной поток процессов. 3) Для тестирования рассматриваются все интерфейсы и серверные системы. 4) Выполняется после завершения тестирования системы. 5) Сквозное тестирование включает в себя проверку внешних интерфейсов, которую сложно автоматизировать. Следовательно, ручное тестирование предпочтительнее. _Системное тестирование_ 1) Проверяет только программную систему в соответствии со спецификациями требований. 2) Проверяет функциональные возможности и функции системы.3) Рассматриваются функциональное и нефункциональное тестирование 4) Выполняется после интеграционного тестирования. 5) Для тестирования системы можно выполнять как ручное, так и автоматизированное тестирование. _ _  Самая большая трудность при этом типе тестирования состоит в том, что необходимо располагать достаточным количеством информации о всей системе, а также о взаимосвязанных подсистемах. ",
        "assets/voise/1qUs20.mp3"
      ],
      "21": [
        "Что такое тестирование безопасности?",
        "это стратегия тестирования, используемая для проверки безопасности системы, а также для анализа рисков, связанных с обеспечением целостного подхода к защите приложения, атак хакеров, вирусов, несанкционированного доступа к конфиденциальным данным. _ Принципы безопасности программного обеспечения _Общая стратегия безопасности основывается на трех основных принципах: _ _1. Конфиденциальность - это сокрытие определенных ресурсов или информации. _Под конфиденциальностью можно понимать ограничение доступа к ресурсу некоторой категории пользователей, или другими словами, при каких условиях пользователь может получить доступ к данному ресурсу. _ _ 2.  Целостность - Существует два основных критерия при определении понятия целостности:_  • Доверие. Ожидается, что ресурс будет изменен только соответствующим способом определенной группой пользователей. _ • Повреждение и восстановление. В случае когда данные повреждаются или неправильно меняются авторизованным или не авторизованным пользователем, вы должны определить на сколько важной является процедура восстановления данных. _  _3.доступность -Доступность представляет собой требования о том, что ресурсы должны быть доступны авторизованному пользователю, внутреннему объекту или устройству. Как правило, чем более критичен ресурс тем выше уровень доступности должен быть. _Виды уязвимостей _ _В настоящее время наиболее распространенными видами уязвимости в безопасности программного обеспечения являются: _ • XSS (Cross-Site Scripting) - это вид уязвимости программного обеспечения (Web приложений), при которой, на генерированной сервером странице, выполняются вредоносные скрипты, с целью атаки клиента. _ • XSRF / CSRF (Request Forgery) - это вид уязвимости, позволяющий использовать недостатки HTTP протокола, при этом злоумышленники работают по следующей схеме: ссылка на вредоносный сайт устанавливается на странице, пользующейся доверием у пользователя, при переходе по вредоносной ссылке выполняется скрипт, сохраняющий личные данные пользователя (пароли, платежные данные и т.д.), либо отправляющий СПАМ сообщения от лица пользователя, либо изменяет доступ к учетной записи пользователя, для получения полного контроля над ней. _ • Code injections (SQL, PHP, ASP и т.д.) - это вид уязвимости, при котором становится возможно осуществить запуск исполняемого кода с целью получения доступа к системным ресурсам, несанкционированного доступа к данным либо выведения системы из строя. _ • Server-Side Includes (SSI) Injection - это вид уязвимости, использующий вставку серверных команд в HTML код или запуск их напрямую с сервера. _ • Authorization Bypass - это вид уязвимости, при котором возможно получить несанкционированный доступ к учетной записи или документам другого пользователя",
        "assets/voise/1qUs21.mp3",
        "http://www.protesting.ru/testing/types/security.html"
      ],
      "22": [
        "Что такое испытание на основе рисков?",
        "Тестирование на основе рисков (risk-based testing) — это метод тестирования программного обеспечения, который базируется на вероятности рисков. _Цель тестирования на основе рисков — сфокусироваться на ключевых функциях и уделить им больше времени. _ _Риск — это непредвиденное событие, которое может отрицательно повлиять на измеряемые критерии успеха проекта. _Так, непредвиденные события могут повлиять на стоимость всего проекта, коммерческие, технические и качественные цели. _  _ • Риски продукта — факторы, которые в конечном итоге приводят к несоответствию конечной функциональности потребностям пользователей и/или ожиданиям клиентов. _ • Риски проекта — проблемы, вызванные внешними зависимостями. Это могут быть проблемы с контрактами, задержки со стороны подрядчика, личные проблемы или ограничения, не связанные с работой._ • Риски процесса — проблемы, связанные с планированием и управлением проектом, в том числе неточные эстимейты, задержки, жесткие дедлайны, недооценка сложности проекта или других важных аспектов. не плохая статья для чьтения https://habr.com/ru/company/simbirsoft/blog/443672/",
        "assets/voise/1qUs22.mp3"
      ],
      "23": [
        "Что такое динамическое тестирование?"," это методика, направленная на проверку функционала программы, во время выполнения кода.","assets/voise/1qUs23.mp3",
        "https://testengineer.ru/chto-takoe-risk-testirovanie/"
        
      ],
      "24": [
        "Что такое «парадокс пестицида»?",
        "Если повторять одни и те же тесты снова и снова, в какой-то момент они перестанут выявлять новые ошибки.",
        "assets/voise/1qUs24.mp3"
      ],
      "25": [
        "Опишите основные фазы STLC (жизненного цикла тестирования)? Дайте определение критери начала (Entry) и завершения (Exit) Criteria.",
        "STLC, или жизненный цикл тестирования — это последовательность действий, проводимых в процессе тестирования, с помощью которых гарантируется качество программного обеспечения и его соответствие требованиям. STLC включает действия по верификации и валидации. Тестирование состоит из серии действий, выполняемых по методике, с целью гарантирования качества продукта. _Entry Criteria (Критерий начала): описывает условия, которые должны быть соблюдены перед тем как начнется тестирование. _ Exit Criteria (Критерий завершения): описывает условия, которые должны быть соблюдены перед тем как тестирование завершится.",
        "assets/voise/1qUs25.mp3"
      ],
      "26": [
        "Представте ситуацию, вам дали 2 одинаковых проекта, т.е с одинаковым приоритетом, одинаковые по сложности и т.п., с какого проекта вы начнёте?",
        "Это ловушка некоторых hr, если ответить 1 или 2 то  ответ не правленый! _Ответ: Не буду угадывать, спрошу у тест-менеджера!. Своебразный вопрос но имеет место быть",
        "assets/voise/1qUs26.mp3"
      ],
      "27": [
        "Какие есть атрибуты баг-репорта? Какие основные поля для заполнения?","баг-репорт -это документ, описывающий последовательность действий, которые привели к некорректной работе системы, с указанием причин и ожидаемого результата. _ _поля в баг репорте _ • ID (идентификатор) _ • Название (Title) _ • Короткое описание (Summary) _ • Проект (Project)_ • Номер версии (Version)_ • Приоритет (Priority)_ • Статус (Status)_ • Автор (Author)_ • Назначен на (Assignee)_ • Окружение (Environment)_ • App/build version (версия билда/приложения)_ • Шаги воспроизведения (Steps to Reproduce) _ • Фактический Результат (Actual Result) _ • Ожидаемый результат (Expected Result) _ • скриншоты _ • видео _ • Логи (браузера, мобилки, сервера)",
        "assets/voise/1qUs27.mp3"
      ],
      "28": [
        "Какова разница между приоритетом и серьезностью?",
        "Серьезность (Severity) — это атрибут, характеризующий влияние дефекта на работоспособность приложения. _Приоритет (Priority) — это атрибут, указывающий на очередность выполнения задачи или устранения дефекта. _Можно сказать, что это инструмент менеджера по планированию работ. Чем выше приоритет, тем быстрее нужно исправить дефект. Severity выставляется тестировщиком Priority — менеджером, тимлидом или заказчиком",
        "assets/voise/1qUs28.mp3"
      ],
      "29": [
        "Приведите примеры серьезного, но не приоритетного бага.",
        "функция в приложении с багом, блокирующим работу всего ПО, которым никто никогда не пользуется,другой вопрос а зачем функция которм никто не пользуется",
        "assets/voise/1qUs29.mp3"
      ],
      "30": [
        "В чем разница между валидацией и верификацией?",
        "Верификация (verification) — оценка соответствия продукта требованиям (спецификации)._Отвечает на вопрос: “Система работает в соответствии с требованиями?”_ _Валидация (validation) — оценка соответствия продукта ожиданиям и требованиям пользователей. _Отвечает на вопрос: “Требования удовлетворяют ожидания пользователя?”",
        "assets/voise/1qUs30.mp3"
      ],
      "31": [
        "Зачем нужна тестовая документация? Какие её виды вы занете?",
        "Тестовая документация — это набор документов, создаваемых перед началом процесса тестирования и непосредственно в процессе. _Эти документы описывают покрытие тестами и процесс выполнения тестов, в них указываются необходимые для тестирования вещи, приводится основная терминология и т. д. _ _Тестовая документация определяет, что для нас важно и почему, какие действия мы должны выполнить и сколько времени у нас есть. Наконец, в документации обозначено, чего должна достичь команда и что сигнализирует об окончании процесса. _Непонимание того, как и почему должна вести себя та или иная функция, приводит к большему количеству ошибок. Неправильная расстановка приоритетов может привести к пропуску багов и предоставлению неполных отчетов. Примеры можно продолжать и продолжать. Перечень тестовой документации это _ _ План тестирования - План тестирования описывает все действия по тестированию в рамках одного проекта. Здесь вы можете найти информацию обо всем, что нужно сделать тестировщику или команде QA в ходе проекта. _ _ Чеклист - то документ, содержащий краткое описание функций, которые должен проверить тестировщик. _ _ Тест-кейс - это артефакт/документ, описывающий совокупность шагов, конкретных условий и параметров, необходимых для проверки тестируемой функции._ _ Сценарий использования (use case) - это более простой и менее официальный документ. Он описывает сценарий взаимодействия с пользовталея с программой . _ Каждый юзкейс основан на предположении о том, что пользователь программы будет делать и где он будет кликать. Это позволяет тестировщикам протестировать предполагаемые пути пользователя._ _ Баг-репорт - это документ, описывающий последовательность действий, которые привели к некорректной работе системы, с указанием причин и ожидаемого результата. _ _Требования - это спецификация (описание) того, что должно быть реализовано.(Требования описывают то, что необходимо реализовать, без детализации технической стороны решения. Что, а не как) ",
        "assets/voise/1qUs31.mp3"
      ],
      "32": [
        "Что такое тест-план?",
        "Это документ описывающий весь объём работы по тестированию",
        "assets/voise/1qUs32.mp3"
      ],
      "33": [
        "Какую обязательную информацию должен содержать тест-план? Как правильно его использовать, поддерживать и нужен ли он вообще для большинства проектов?",
        "Тест план содержит обязательно ответ на ниже указанные вопросы: _ Что тестируем? _когда? _Критерии начала/окончания тестирования. _Окружение (environment) dev/staging/production? _Подходы/техники/инструменты/виды тестирования? _Браузеры/версии/OS/разрешения экрана? _Кто? Обязанности? Ресурсы? Обучение? _Сроки? _график? _Стратегия тестирования _Ссылки на документацию. _ _Если тестирование не документируется, это мешает увидеть полную картину проекта. _Без четких целей, пошагового плана по их достижению и указания всех важных условий ожидаемый результат будет неясен. В таких условиях у всех может быть разное понимание общей цели и конечного продукта.  ",
        "assets/voise/1qUs33.mp3"
      ],
      "34": [
        "Что такое Сборка?",
        "Тестирование направленное на определение соответствия, выпущенной версии, критериям качества для начала тестирования. По своим целям является аналогом Дымового Тестирования, направленного на приемку новой версии в дальнейшее тестирование или эксплуатацию. Вглубь оно может проникать дальше, в зависимости от требований к качеству выпущенной версии. _Чаще всего это исполняемый файл (содержащий исполняемый код программы). _Предположим, что номер версии сборки выглядит так: 1.35.6.2_ _ 1 Первый идентификатор — основной номер версии. _ 2 Второй идентификатор — дополнительный номер версии. _ 3 Третий идентификатор — номер сборки. _ 4 Четвёртый идентификатор — номер редакции.",
        "assets/voise/1qUs34.mp3"
      ],
      "35": [
        "Что такое тестовый драйвер и тестовая обвязка?",
        "Драйвер (driver) — это компонент ПО или средство тестирования, которое заменяет компонент, обеспечивающий управление и/или вызов компонента или системы. _Обвязка (harness) — это тестовое окружение, включающее в себя заглушки и драйверы, необходимые для проведения теста._ Не уверен в корректности данных определений!",
        "assets/voise/1qUs35.mp3"
      ],
      "36": [
        "Что такое приемочное тестирование? И когда проводится ?",
        "Приемочное тестирование или Приемо-сдаточное испытание. _Формальный процесс тестирования, который проверяет соответствие системы требованиям и проводится с целью: _• определения удовлетворяет ли система приемочным критериям; _• вынесения решения заказчиком или другим уполномоченным лицом принимается приложение или нет. _Приемочное тестирование выполняется на основании набора типичных тестовых случаев и сценариев, разработанных на основании требований к данному приложению. _Решение о проведении приемочного тестирования принимается, когда: _• продукт достиг необходимого уровня качества; _• заказчик ознакомлен с Планом Приемочных Работ (Product Acceptance Plan) или иным документом, где описан набор действий, связанных с проведением приемочного тестирования, дата проведения, ответственные _• Фаза приемочного тестирования длится до тех пор, пока заказчик не выносит решение об отправлении приложения на доработку или выдаче приложения.",
        "assets/voise/1qUs36.mp3"
      ],
      "37": [
        "Что такое <Системное тестирование> ?",
        "это тестирование программного обеспечения выполняемое на полной, интегрированной системе, с целью проверки соответствия системы исходным требованиям, как функциональным, так и не функциональным. Объект тестирования выделен красным цветом. _При этом выявляются дефекты, такие как неверное использование ресурсов системы. _   • непредусмотренные комбинации данных пользовательского уровня _    • непредусмотренные сценарии использования _    • отсутствующая или неверная функциональность, неудобство использования и т.д _во время тестирования рекомендуется использовать окружение максимально приближенное к тому, на которое будет установлен продукт после выдачи",
        "assets/voise/1qUs37.mp3","https://qalight.ua/ru/baza-znaniy/sistemnoe-testirovanie/#:~:text=%D0%A1%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D0%BD%D0%BE%D0%B5%20%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%E2%80%93%20%D1%8D%D1%82%D0%BE%20%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BD%D0%BE%D0%B3%D0%BE,%D0%9E%D0%B1%D1%8A%D0%B5%D0%BA%D1%82%20%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F%20%D0%B2%D1%8B%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%20%D0%BA%D1%80%D0%B0%D1%81%D0%BD%D1%8B%D0%BC%20%D1%86%D0%B2%D0%B5%D1%82%D0%BE%D0%BC."
      ],
      "38": [
        "Какие Виды Тестирования вы знаете ",
        "Все виды тестирования программного обеспечения, в зависимости от преследуемых целей, можно условно разделить на следующие группы: _    • Функциональные _    • Нефункциональные _    • Связанные с изменениями _ _Функциональные тесты базируются на функциях и особенностях, а также взаимодействии с другими системами, и могут быть представлены на всех уровнях тестирования: компонентном или модульном, интеграционном , системном и приемочном . Функциональные виды тестирования рассматривают внешнее поведение системы. Далее перечислены одни из самых распространенных видов функциональных тестов: _    • Функциональное тестирование  _    • Тестирование безопасности  _    • Тестирование взаимодействия (Interoperability Testing GUI ) _ _Нефункциональное тестирование описывает тесты, необходимые для определения характеристик программного обеспечения, которые могут быть измерены различными величинами. В целом, это тестирование того, Как система работает. Далее перечислены основные виды нефункциональных тестов: _Все виды тестирования производительности: _     • нагрузочное тестирование (Performance and Load Testing) _  • стрессовое тестирование (Stress Testing) _     • тестирование стабильности или надежности (Stability / Reliability Testing)      _      • объемное тестирование (Volume Testing)  Тестирование установки (Installation testing) _ • Тестирование удобства пользования (Usability Testing)  _ • Тестирование на отказ и восстановление (Failover and Recovery Testing)  _ • Конфигурационное тестирование (Configuration Testing)  _ • Тестирование безопасности (Security and Access Control Testing)    _ _Связанные с изменениями виды тестирования _После проведения необходимых изменений, таких как исправление бага/дефекта, программное обеспечение должно быть пере тестировано для подтверждения того факта, что проблема была действительно решена. Ниже перечислены виды тестирования, которые необходимо проводить после установки программного обеспечения, для подтверждения работоспособности приложения или правильности осуществленного исправления дефекта: _ • Дымовое тестирование (Smoke Testing) _ • Регрессионное тестирование (Regression Testing) _ • Тестирование сборки (Build Verification Test) _ • Санитарное тестирование или проверка согласованности/исправности (Sanity Testing)",
        "assets/voise/1qUs38.mp3"
      ],
      "39": [
        "Что такое ООП? Назовите его принципы с примерами?",
        "Объе́ктно-ориенти́рованное программи́рование (ООП) — методология программирования, основанная на представлении программы в виде совокупности объектов, каждый из которых является экземпляром определенного класса, а классы образуют иерархию наследования._Принципы ООП: _Принцип 1. Наследование - механизм, который позволяет описать новый класс на основе существующего (родительского). При этом свойства и функциональность родительского класса заимствуются новым классом. _Для чего нужно наследование и какие преимущества оно дает? _Прежде всего — повторное использование кода. Поля и методы, описанные в родительских классах, можно использовать в классах-потомках. _Если у всех типов автомобилей есть 10 общих полей и 5 одинаковых методов, тебе достаточно вынести их в родительский класс Auto. Ты сможешь использовать их в классах-потомках безо всяких проблем. _ Принцип 2. Абстракция - Это очень простой принцип. Абстракция означает выделение главных, наиболее значимых характеристик предмета и наоборот — отбрасывание второстепенных, незначительных.  _ Скажем, мы создаем картотеку работников компании. Для создания объектов «работник» мы написали класс Employee. Какие характеристики важны для их описания в картотеке компании? ФИО, дата рождения, номер социального страхования, ИНН. Но вряд ли в карточке такого типа нам нужны его рост, цвет глаз и волос. Компании эта информация о сотруднике ни к чему. _Поэтому для класса Employee мы зададим переменные String name, int age, int socialInsuranceNumber и int taxNumber, а от лишней для нас информации вроде цвета глаз откажемся, абстрагируемся. _Инкапсуляция - в Java означает ограничение доступа к данным и возможностям их изменения. _У тебя есть имя и фамилия. Их знают все твои знакомые. Но у них нет доступа к изменению твоего имени и фамилии. Этот процесс, можно сказать, «инкапсулирован» в паспортном столе: поменять имя фамилию можно только там, и сделать это можешь только ты. Остальные «пользователи» имеют доступ к твоему имени и фамилии «только на чтение» :) _Принцип 4. Полиморфизм  — это возможность работать с несколькими типами так, будто это один и тот же тип. При этом поведение объектов будет разным в зависимости от типа, к которому они принадлежат.есть хороший пример на сайте ",
        "assets/voise/1qUs39.mp3",
        "https://javarush.com/groups/posts/1966-principih-obhhektno-orientirovannogo-programmirovanija"
      ],
      "40": [
        "Что такое интерфейс? Что такое абстрактный класс? Чем они отличаются?",
        " ответ может дать автотестер коорый пишет на Java : Абстрактный класс — это класс, у которого не реализован один или больше методов (некоторые языки требуют такие методы помечать специальными ключевыми словами). _Интерфейс — это абстрактный класс, у которого ни один метод не реализован, все они публичные и нет переменных класса. _Интерфейс нужен обычно когда описывается только интерфейс (тавтология). Например, один класс хочет дать другому возможность доступа к некоторым своим методам, но не хочет себя «раскрывать». Поэтому он просто реализует интерфейс. _Абстрактный класс нужен, когда нужно семейство классов, у которых есть много общего. Конечно, можно применить и интерфейс, но тогда нужно будет писать много идентичного кода",
        "assets/voise/1qUs40.mp3"
      ],
      "41": [
        "Что такое SOLID? Приведите примеры.",
        "это набор принципов, следуя которым, программный код будет более чистым и гибким. Т. е. это не библиотека или технология, это просто правила, которым должен следовать разработчик в кманде если компания разделяет данный подход .расшифровка _ S: Single Responsibility Principle (Принцип единственной ответственности). _ O: Open-Closed Principle (Принцип открытости-закрытости)._ L: Liskov Substitution Principle (Принцип подстановки Барбары Лисков). _ I: Interface Segregation Principle (Принцип разделения интерфейса). _ D: Dependency Inversion Principle (Принцип инверсии зависимостей). ",
        "assets/voise/1qUs41.mp3",
        "https://habr.com/ru/company/ruvds/blog/426413/"
      ],
      "42": [
        "Что такое DRY, KISS, YAGNI?",
        "Это все ринципы для разработки: _1. YAGNI (You Aren’t Gonna Need It / Вам это не понадобится)- Этот принцип прост и очевиден, но ему далеко не все следуют. Если пишете код, то будьте уверены, что он вам понадобится. Не пишите код, если думаете, что он пригодится позже. _ 2. DRY (Don’t Repeat Yourself / Не повторяйтесь) - В проектировании и теории информационных систем единый источник истины (SSOT) – это практика структурирования информационных моделей и схемы данных, которая подразумевает, что все фрагменты данных обрабатываются (или редактируются) только в одном месте… SSOT предоставляют достоверные, актуальные и пригодные к использованию данные. _простыми словами Дублирование кода – пустая трата времени и ресурсов. Вам придется поддерживать одну и ту же логику и тестировать код сразу в двух местах, причем если вы измените код в одном месте, его нужно будет изменить и в другом _3. KISS (Keep It Simple, Stupid / Будь проще) -  Этот принцип гласит, что простые системы будут работать лучше и надежнее. _Не придумывайте к задаче более сложного решения, чем ей требуется! Иногда самое разумное решение оказывается и самым простым. Написание производительного, эффективного и простого кода – это прекрасно. ",
        "assets/voise/1qUs42.mp3",
        "https://habr.com/ru/company/itelma/blog/546372/"
      ],
      "43": [
        "Что такое паттерны? Какие паттерны GOF вам известны? Приведите примеры их использования.",
        "Паттерны проектирования описывают общую структуру взаимодействия элементов программной системы, которые реализуют исходную проблему проектирования в конкретном контексте. Наиболее известными паттернами этой категории являются паттерны GoF (Gang of Four). Паттерны GoF включают в себя 23 паттерна. Эти паттерны не зависят от языка реализации, но их реализация зависит от области приложения._Шаблоны проектирования — это готовые шаблоны, позволяющие решать частые проблемы разработки. Существуют проблемы, требующие совершенно новых решений, но большинство уже встречалось разработчикам, поэтому их можно решить, применяя проверенные подходы, или шаблоны. _В число популярных шаблонов проектирования входят Адаптер (Adapter), Мост (Bridge), Декоратор (Decorator), Фасад (Façade), Фабричный метод, Наблюдатель (Observer), Одиночка (Singleton), Стратегия (Strategy) и Шаблонный метод (Template Method). _Шаблоны снижают сложность, предоставляя готовые абстракции Если вы скажете: «В этом фрагменте для создания экземпляров производных классов применяется шаблон 'Фабричный метод'», — другие программисты поймут, что ваш код включает богатый набор взаимодействий и протоколов программирования, специфических для названного шаблона. _Шаблон «Фабричный метод» позволяет создавать экземпляры любого класса, производного от указанного базового класса, причем отдельные производные классы отслеживаются только самим «Фабричным методом». Если вы будете использовать шаблоны, другие программисты легко поймут выбранный вами подход к проектированию без подробного обсуждения кода.",
        "assets/voise/1qUs43.mp3",
        "https://studfile.net/preview/9431262/page:9/"
      ],
      "44": [
        "Что такое Page Object и Page Factory?",
        "Объектная модель страницы (Page Object Model (POM)) — это шаблон проектирования, широко используемый в автоматизации тестирования, который создает репозиторий объектов для элементов веб-интерфейса. Преимущество модели в том, что она уменьшает дублирование кода и улучшает сопровождение тестов. _Фабрика страниц в Selenium (Page Factory) — это встроенная концепция фреймворка Page Object Model для Selenium WebDriver, но она очень оптимизирована. Он используется для инициализации объектов Page или для создания экземпляра самого объекта Page. Он также используется для инициализации элементов класса Page без использования «FindElement/s».",
        "assets/voise/1qUs44.mp3",
        "https://www.guru99.com/page-object-model-pom-page-factory-in-selenium-ultimate-guide.html"
      ],
      "45": [
        "Какая иерархия Collections?",
        "На вершине иерархии в Java Collection Framework располагаются 2 интерфейса: Collection и Map . Эти интерфейсы разделяют все коллекции, входящие во фреймворк на две части по типу хранения данных: простые последовательные наборы элементов и наборы пар «ключ — значение» (словари). просто определение из гугла, дальше не знаю ",
        "assets/voise/1qUs45.mp3"
      ],
      "46": [
        "Какая разница между Thread class и Runnable interface?",
        "В Java многопоточность программы организуется с помощью интерфейса Runnable и класса Thread, который наследуется от Runnable. Первый способ более гибкий, второй – проще. Та часть кода, которая должна выполняться в отдельном потоке, выносится в свой класс, имеющий переопределенный метод run().",
        "assets/voise/1qUs46.mp3"
      ],
      "47": [
        "Какая разница между String, Stringbuffer и Stringbuilder?",
        "String – неизменяемая строка. StringBuffer — потокобезопасная изменяемая строка. StringBuilder – изменяемая строка с высокой производительностью, но без синхронизации.",
        "assets/voise/1qUs47.mp3"
      ],
      "48": [
        "Разница между final, finally и finalize?",
        "В чем разница между final, finally и finalize? Основное различие между final, finally и finalize заключается в том, что final — это модификатор доступа, finally — блок в обработке исключений, а finalize — метод класса объекта. ",
        "assets/voise/1qUs48.mp3"
      ],
      "49": [
        " Какие принципы тестирования вы знаете ?",
        "• Тестирование демонстрирует наличие дефектов, а не их отсутствие _•Исчерпывающее тестирование недостижимо _•Раннее тестирование сохраняет время и деньги _•Кластеризация дефектов _•Парадокс пестицида _•Тестирование зависит от контекста _•Заблуждение об отсутствии ошибок",
        "assets/voise/1qUs49.mp3"
      ],
      "50": [
        "​​Что такое Selenium и зачем его используют?",
        "Selenium WebDriver — это инструмент, который позволяет производить кросс-браузерное тестирование, то есть проверять, как отображается сайт в разных браузерах.",
        "assets/voise/1qUs50.mp3"
      ],
      "51": [
        "Что такое драйвер браузера?",
        "У программных средств Selenium разные подходы к автоматизации тестирования. WebDriver нужен для управления браузером, как локальным, так и удаленным. Это гибкий инструмент: он легко интегрируется с тестовыми фреймворками и другими инструментами. На его основе можно создать узконаправленные инструменты для кроссбраузерного тестирования. _WebDriver — главный вектор развития Selenium. Вот его основные преимущества: _Поддерживает разные языки программирования (Java, JavaScript, C#, PHP, Ruby, Perl, Python), а значит, его может использовать большое количество разработчиков. _Облегчает кроссбраузерное тестирование и поддерживает различные браузеры: Firefox, Opera, Chrome, Edge. _Есть фреймворки, облегчающие разработку.",
        "assets/voise/1qUs51.mp3",
        "https://blog.skillfactory.ru/glossary/selenium-webdriver/"
      ],
      "52": [
        "Какие виды локаторов страницы существуют? Каковы их преимущества и недостатки?",
        "id=<element_id> - соответствует элементу, у которого атрибут id равен значению element_id. Например, у нас есть элемент, данный локатор должен быть один для элемента,должен но не всегда такой :) _name=<element_name> - соответствует элементу, у которого атрибут name равен значению element_name. _dom=<dom_object> - данный тип локатора позволяет обращаться к элементу так же, как и в DHTML используя DOM-структуру. _link=<link_text> - специально для ссылок используется отдельно зарезервированный тип локаторов, который находит нужную ссылку по ее тексту. _xpath=<xpath_locator> - наиболее универсальный тип локаторов. Как XPath формируется. HTML, как и его более обобщенная форма - XML, представляет собой различное сочетание тегов, которые могут содержать вложенные теги, а те в свою очередь тоже могут содержать теги и т.д. То есть ,выстраивается определенная иерархия, наподобие структуры каталогов в файловой системе. _css=<css_path> - данный тип локаторов основан на описаниях таблиц стилей (CSS), соответственно и синтаксис такой же.   ",
        "assets/voise/1qUs52.mp3"
      ],
      "53": [
        "Что такое Selenium Waits? Какие есть и чем отличаются?",
        "Ожидания - непременный атрибут любых UI тестов для динамических приложений. Нужны они для синхронизации работы AUT и тестового скрипта. Скрипт выполняется намного быстрее реакции приложения на команды, поэтому часто в скриптах необходимо дожидаться определенного состояния приложения для дальнейшего с ним взаимодействия. _ бывают разные ожидатели обычно это по селектору, ожидать ответа от сервера, перехаода на другую страницу или навигацияпо странице!",
        "assets/voise/1qUs53.mp3"
      ],
      "54": [
        "Какие exceptions может бросить Selenium? Что они означают и как их обрабатывать?",
        "Есть хорошая статья вот сылка https://testengineer.ru/oshibki-v-selenium-gajd-po-exceptions/ ",
        "assets/voise/1qUs54.mp3",
        "https://testengineer.ru/oshibki-v-selenium-gajd-po-exceptions/"
      ],
      "55": [
        "Для чего используют JavaScriptExecutor? Приведите примеры.",
        "JavaScript executor — это интерфейс, предоставляемый Selenium, который предоставляет механизм для выполнения JavaScript через Selenium WebDriver. _Он предоставляет два метода, такие как «executeScript» и «executeAsyncScript», для запуска JavaScript в текущем выбранном фрейме, окне или странице.",
        "assets/voise/1qUs55.mp3",
        "https://atesting.ru/javascriptexecutor-v-selenium-webdriver-metody-s-primerami/"
      ],
      "56": [
        "Что такое Selenium Grid?",
        "Selenium Grid — кластер из нескольких Selenium-серверов, которые позволяют управлять браузером удаленно по сети. Grid позволяет организовать сеть, в которой можно запускать большое количество браузеров на большом количестве компьютеров. Параллельное тестирование позволяет тестировщикам экономить время.",
        "assets/voise/1qUs56.mp3",
        "https://blog.skillfactory.ru/glossary/selenium/#:~:text=Selenium%20Grid%20%E2%80%94%20%D0%BA%D0%BB%D0%B0%D1%81%D1%82%D0%B5%D1%80%20%D0%B8%D0%B7%20%D0%BD%D0%B5%D1%81%D0%BA%D0%BE%D0%BB%D1%8C%D0%BA%D0%B8%D1%85,%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BF%D0%BE%D0%B7%D0%B2%D0%BE%D0%BB%D1%8F%D0%B5%D1%82%20%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D1%89%D0%B8%D0%BA%D0%B0%D0%BC%20%D1%8D%D0%BA%D0%BE%D0%BD%D0%BE%D0%BC%D0%B8%D1%82%D1%8C%20%D0%B2%D1%80%D0%B5%D0%BC%D1%8F."
      ],
      "57": [
        "Какие способы click и send keys Selenium?",
        " click -к ликнуть по элементу, sendkeys - набор текста в полеинпут и тд",
        "assets/voise/1qUs57.mp3"
      ],
      "58": [
        "Как вы запускаете параллельное выполнение тестов? Что такое ThreadLocal?",
        "ThreadLocal — класс, позволяющий имея одну переменную, иметь различное её значение для каждого из потоков. _ Так тут дело так понимаю в многопоточности java с ним я не работал, но проблема в том что и в JS я параллельные тесты не делал :/ ",
        "assets/voise/1qUs58.mp3"
      ],
      "59": [
        "Какая разница между Action и Actions?","",
        "assets/voise/1qUs59.mp3"
      ],
      "60": [
        "Как написать метод isElementPresent?",
        "   Одной из наиболее частых проверок в автотестах является проверка присутствия какого-либо объекта на странице. В SeleniumIDE для этого существует метод isElementPresent, а для вебдрайвера такого метода нет, но можно написать свой собственный метод:_    public static boolean isElementPresent(By by) { _      try { _        driver.findElement(by); _        return true; _      } catch (NoSuchElementException e) { _        return false; _  }  _  }",
        "assets/voise/1qUs60.mp3"
      ],
      "61": [
        "Как вычитать данные из динамической веб-таблицы?",
        "не совсем понимаю суть данного вопроса, но если самый банальный ответ, подождать пока данные сформируются и после спарсть их со страницы, если они меняются все время то и это будет спарсить несложно",
        "assets/voise/1qUs61.mp3"
      ],
      "62": [
        "Можете ли вы назвать 10 интерфейсов в Selenium?",
        "1) .keyDown(Key.SHIFT) -зажать кнопку (shift,ctrl) 2) _.sendKeys('a') - нажать на кнопку 3) _keyUp(Key.SHIFT) - разжать кнопку (shift,ctrl) 4) _.click() - нажать! 5) _.scroll(0, 0, 0, 0, iframe)-проскролить, 6)_.wait()- ожидание чего либо 7) _.findElement() - ждет пока динамически добавленный элемент из скрипта не будет добавлен в DOM 8)_.getText()-получает текст из элемента на странице 9) .navigate().refresh()- Обновить текущую страницу 10).close() -закрыть окно",
        "assets/voise/1qUs62.mp3",
        "https://www.selenium.dev/documentation/webdriver/"
      ],
      "63": [
        "Назовите два способа, позволяющих автоматизировать капчу.",
        "есть платные сервисы Решить reCAPTCHA 2 в Selenium и склоняются в интернете в эту сторону Но естьочень хорошая статья ",
        "assets/voise/1qUs63.mp3",
        "http://cccp-blog.com/razrabotchiku/kak-obojti-kapchu#kak-obojti-kapchu"
      ],
      "64": [
        "Вспомните типы навигационных команд Selenium.",
        ".get(url); - открыть сайт _ driver.navigate().back();-Нажатие кнопки «Назад» в браузере _driver.navigate().forward(); - Нажатие кнопки браузера вперед _ await driver.navigate().refresh(); - Обновить текущую страницу",
        "assets/voise/1qUs64.mp3",
        "https://www.selenium.dev/documentation/webdriver/interactions/navigation/"
      ],
      "65": [
        "Как найти поврежденные ссылки в Selenium WebDriver?",
        "нужно собрать ссылки на странице и сделать http запросы и посмотреть на статус тветы и на получения контента на дрги страницах ",
        "assets/voise/1qUs65.mp3"
      ],
      "66": [
        "Какую технику следует рассмотреть, используя весь сценарий, если «нет ни frame id, ни frame name»?",
        "всегда есть возможность использовать селекор XPath, скапировав селктор в DevTools! Крутить Dom элемнетом можно как угодно",
        "assets/voise/1qUs66.mp3"
      ],
      "67": [
        "что такое Интеграционное тестирование ? какие уровни вы знаете и подходы?",
        "Интеграционное тестирование предназначено для проверки связи между компонентами, а также взаимодействия с различными частями системы (операционной системой, оборудованием либо связи между различными системами). _   Уровни интеграционного тестирования: _    • Компонентный интеграционный уровень (Component Integration testing) _        Проверяется взаимодействие между компонентами системы после проведения компонентного тестирования. _    • Системный интеграционный уровень (System Integration Testing) _        Проверяется взаимодействие между разными системами после проведения системного тестирования. _ • Подходы к интеграционному тестированию:_ _ Снизу вверх (Bottom Up Integration) - Все низкоуровневые модули, процедуры или функции собираются воедино и затем тестируются. После чего собирается следующий уровень модулей для проведения интеграционного тестирования. Данный подход считается полезным, если все или практически все модули, разрабатываемого уровня, готовы. Также данный подход помогает определить по результатам тестирования уровень готовности приложения _ • Сверху вниз (Top Down Integration) - Вначале тестируются все высокоуровневые модули, и постепенно один за другим добавляются низкоуровневые. Все модули более низкого уровня симулируются заглушками с аналогичной функциональностью, затем по мере готовности они заменяются реальными активными компонентами. Таким образом мы проводим тестирование сверху вниз. _ • Большой взрыв  - Все или практически все разработанные модули собираются вместе в виде законченной системы или ее основной части, и затем проводится интеграционное тестирование. Такой подход очень хорош для сохранения времени. Однако если тест кейсы и их результаты записаны не верно, то сам процесс интеграции сильно осложнится, что станет преградой для команды тестирования при достижении основной цели интеграционного тестирования",
        "assets/voise/1qUs67.mp3"
      ],
      "68": [
        "Есть 8 бильярдных шаров. Один из них немного тяжелее других. За какое минимальное количество взвешиваний на рычажных весах без гирь можно найти этот шар?",
        "ф2 шага. Нужно разделить все шары на три части: по 3 шара в двух частях, и 2 шара в третьей части. Сначала взвешиваете первые две части по 3 шара. Если одна из частей оказалась тяжелее, то взвешиваем между собой любые 2 шара из нее. Или один из них будет искомым шаром, или не взвешенный, если они оказались равны. В случае равного веса частей при первом взвешивании, более тяжелый шар окажется в третьей части из двух шаров.",
        "assets/voise/1qUs68.mp3"
      ],
      "69": [
        "Почему канализационные люки имеют круглую форму? ",
        "за счет равного диаметра круга люк не проваливается в канализацию, второй – круглые люки легче переносить",
        "assets/voise/1qUs69.mp3"
      ],
      "70": [
        "Почему фраза 'сам прочитаешь?' считается уникальной? ",
        "",
        "assets/voise/1qUs70.mp3"
      ],
      "71": [
        "Перед вами два мотка веревки. Если взять их концы и поджечь, то каждый моток сгорает за один час. Вопрос: как правильно отмерить 45 минут, применяя 2 таких мотка веревки, при условии, что веревку нет возможности делить?",
        "стоит одновременно поджечь один моток с двух концов, а второй – с одной стороны. Ровно через 30 минут первый моток полностью выгорит, а второму останется гореть 30 минут. Дабы получить желаемые 15 минут, его придется подпалить с обеих сторон. Все просто!",
        "assets/voise/1qUs71.mp3"
      ],
      "72": [
        "Перед вами 50 мопедов с полным баком бензина на 100 километров. Как далеко можно уехать, при условии, что все они стартуют из одной точки?",
        "1) Заводим мопеды одновременно и едем 100 километров. _2)Двигаем мопеды на 50 км, переливаем бензин из половины мопедов в другую половину. Так у нас получается 25 мопедов с полностью заполненным баком топлива. Едем дальше и повторяем данное действие каждые 50 км. Подобным образом можно продвинуться на 350 километров.",
        "assets/voise/1qUs72.mp3",
        "https://tproger.ru/articles/10-logicheskih-zadach-s-sobesedovanij-kotorye-zastavjat-zastrelitsja/"
      ],
      "73": [
        "Какие виды тест планов вы знаете ?",
        "Чаще всего на практике приходится сталкиваться со следующими видами тест планов: _ • Мастер Тест План (Master Plan or Master Test Plan) _ • Тест План (Test Plan), назовем его детальный тест план) _ • План Приемочных Испытаний (Product Acceptance Plan) - документ, описывающий набор действий, связанных с приемочным тестированием (стратегия, дата проведения, ответственные работники и т.д.) ",
        "assets/voise/1qUs73.mp3",
        "http://www.protesting.ru/testing/plan.html"
      ],
      "74": [
        "Расскажите о своем последнем проекте.","",
        "assets/voise/1qUs74.mp3"
      ],
      "75": [
        "Для чего используют системы контроля версий?",
        " Системы контроля версий — это программные инструменты, помогающие командам разработчиков управлять изменениями в исходном коде с течением времени. В свете усложнения сред разработки они помогают командам разработчиков работать быстрее и эффективнее.",
        "assets/voise/1qUs75.mp3"
      ],
      "76": [
        "Что такое Git? Каков принцип его работы?",
        "Git — это набор консольных утилит, которые отслеживают и фиксируют изменения в файлах (чаще всего речь идет об исходном коде программ, но вы можете использовать его для любых файлов на ваш вкус). ",
        "assets/voise/1qUs76.mp3"
      ],
      "77": [
        "Что такое commits, branches в Git?",
        "Можно сказать, что коммит это основной объект в любой системе управления версиями. В нем содержится описание тех изменений, которые вносит пользователь в код приложения. В Git коммит состоит из нескольких так называемых объектов. _Команда git branch позволяет создавать, просматривать, переименовывать и удалять ветки. Она не дает возможности переключаться между ветками или выполнять слияние разветвленной истории. Именно поэтому команда git branch тесно связана с командами git checkout и git merge .",
        "assets/voise/1qUs77.mp3"
      ],
      "78": [
        "Для чего нужны GitHub, GitLab и другие, базирующиеся на Git, вебхостинги проектов?",
        "GitHub - это репазиторий в которой храниться наши файлы продукта как в откртом досупе так и в закрытом и системой контрлся весриий .  GitLab является конкурентом GitHub, в котором среди многих других проектов размещается разработка ядра Linux Линуса Торвальдса. Поскольку GitLab разрабатывается на той же основе управления версиями (Git), принцип их работы схож. GitLab поддерживает как публичные, так и неограниченное количество частных ветвей разработки. ",
        "assets/voise/1qUs78.mp3"
      ],
      "79": [
        "Дайте определения Баг Репорта? опишите структуру баг репорта!",
        "Баг репорт - это документ, описывающий ситуацию или последовательность действий приведшую к некорректной работе объекта тестирования, с указанием причин и ожидаемого результата. ID (идентификатор) _Название (Title) _Короткое описание (Summary)_Проект (Project)_Компонент приложения (Component)_Номер версии (Version)_Серьезность (Severity)_Приоритет (Priority)_Статус (Status)_Автор (Author)_Назначен на (Assignee)_Окружение (Environment)_App/build version _версия билда/приложения) _Шаги воспроизведения (Steps to Reproduce) _Фактический Результат (Actual Result) _Ожидаемый результат (Expected Result) _Screenshots (скриншоты) ",
        "assets/voise/1qUs79.mp3"
      ],
      "80": [
        "что такое Операционное тестирование",
        "Даже если система удовлетворяет всем требованиям, важно убедиться в том, что она удовлетворяет нуждам пользователя и выполняет свою роль в среде своей эксплуатации, как это было определено в бизнес моделе системы. Следует учесть, что и бизнес модель может содержать ошибки. Поэтому так важно провести операционное тестирование как финальный шаг валидации. Кроме этого, тестирование в среде эксплуатации позволяет выявить и нефункциональные проблемы, такие как: конфликт с другими системами, смежными в области бизнеса или в программных и электронных окружениях; недостаточная производительность системы в среде эксплуатации и др. Очевидно, что нахождение подобных вещей на стадии внедрения — критичная и дорогостоящая проблема. Поэтому так важно проведение не только верификации, но и валидации, с самых ранних этапов разработки ПО.",
        "assets/voise/1qUs80.mp3"
      ],
      "81": [
        " Что такое CI?",
        "CI — это сборка, деплой и тестирование приложения без участия человека. ",
        "assets/voise/1qUs81.mp3"
      ],
      "82": [
        " Как автоматическое тестирование интегрируется в CI?",
        "CI собирает билд, после выполняет прогон атвотестов, после можно настроить на развертывание приложение на тестовом стенде",
        "assets/voise/1qUs82.mp3"
      ],
      "83": [
        " Как настроить Job или Pipeline на знакомом вам CI-инструменте?","",
        "assets/voise/1qUs83.mp3"
      ],
      "84": [
        " Какие инструменты для генерации репорта после выполнения автоматических тестов вы знаете?","",
        "assets/voise/1qUs84.mp3"
      ],
      "85": [
        " Какую информацию должен содержать отчет о выполнении автоматических тестов?","",
        "assets/voise/1qUs85.mp3"
      ],
      "86": [
        "Что такое клиент-серверная архитектура?",
        "«Клиент — сервер» (англ. client–server) — вычислительная или сетевая архитектура, в которой задания или сетевая нагрузка распределены между поставщиками услуг, называемыми серверами, и заказчиками услуг, называемыми клиентами. Фактически клиент и сервер — это программное обеспечение.",
        "",
        "assets/voise/1qUs86.mp3"
      ],
      "87": [ "Что может выступать в роли клиента?","", "assets/voise/1qUs87.mp3" ],
      "88": [
        "Что такое REST API, SOAP? В чем разница?","",
        "assets/voise/1qUs88.mp3"
      ],
      "89": [
        "Какие протоколы передачи данных знаете?","",
        "assets/voise/1qUs89.mp3"
      ],
      "90": [
        "Какие способы взаимодействия с API существуют? В чем разница между ними?","",
        "assets/voise/1qUs90.mp3"
      ],
      "91": [
        "Как можно протестировать API, что там нужно проверять?","",
        "assets/voise/1qUs91.mp3"
      ],
      "92": [ "Как расшифровывается CRUD?", "","assets/voise/1qUs92.mp3" ],
      "93": [ "Чем отличается GET от POST?", "","assets/voise/1qUs93.mp3" ],
      "94": [ "Какие отличия между XML и JSON?", "","assets/voise/1qUs94.mp3" ],
      "95": [
        "Какие знаете форматы передачи данных?","",
        "assets/voise/1qUs95.mp3"
      ],
      "96": [ "Как происходит шифрование?", "","assets/voise/1qUs96.mp3" ],
      "97": [ "Какие бывают виды баз данных?", "","assets/voise/1qUs97.mp3" ],
      "98": [
        "Охарактеризуйте каждый класс status code (1хх; 2xx; 3xx; 4xx; 5xx).","",
        "assets/voise/1qUs98.mp3"
      ],
      "99": [ "Какие есть HTTP-методы?", "","assets/voise/1qUs99.mp3" ],
      "100": [ "Какие знаете Web elements?", "","assets/voise/1qUs100.mp3" ],
      "101": [
        "Какие браузеры знаете? В чем их отличие?","",
        "assets/voise/1qUs101.mp3"
      ],
      "102": [
        "Для чего необходимы инструменты разработчика в браузере (Chrome DevTools) и как они помогают в тестировании.","",
        "assets/voise/1qUs102.mp3"
      ],
      "103": [ "Что такое кэш?","", "assets/voise/1qUs103.mp3" ],
      "104": [ "Что такое сессия?","", "assets/voise/1qUs104.mp3" ],
      "105": [ "Зачем нужны cookies?","", "assets/voise/1qUs105.mp3" ],
      "106": [ "Что такое фрейм?","", "assets/voise/1qUs106.mp3" ],
      "107": [ "Что такое HTML/CSS/JavaScript?","", "assets/voise/1qUs107.mp3" ],
      "108": [ "Какую структуру имеет веб-страница?", "","assets/voise/1qUs108.mp3" ],
      "109": [ "Зачем чистить кэш?", "","assets/voise/1qUs109.mp3" ],
      "110": [
        "Какие виды тестирования можно применить только к Web?","",
        "assets/voise/1qUs110.mp3"
      ],
      "111": [
        "Для чего в веб-страницах используют JavaScript?","",
        "assets/voise/1qUs111.mp3"
      ],
      "112": [ "Что такое REST?","", "assets/voise/1qUs112.mp3" ],
      "113": [ "Что такое AJAX?","", "assets/voise/1qUs113.mp3" ],
      "114": [
        "Какие мобильные платформы существуют?","",
        "assets/voise/1qUs114.mp3"
      ],
      "115": [
        "Какие версии Android и iOS используются на рынке (минимальные и максимальные)?","",
        "assets/voise/1qUs115.mp3"
      ],
      "116": [
        "Какие версии Android нужно тестировать, если заказчик сказал поддерживать с версии 5.0?","",
        "assets/voise/1qUs116.mp3"
      ],
      "117": [ "Назовите типы мобильных приложений.", "","assets/voise/1qUs117.mp3" ],
      "118": [
        "Каков формат файлов сборок приложений для Android и iOS?","",
        "assets/voise/1qUs118.mp3"
      ],
      "119": [ "Что такое ADB?","", "assets/voise/1qUs119.mp3" ],
      "120": [ "Как снять логи с AOS/IOS?", "","assets/voise/1qUs120.mp3" ],
      "121": [
        "Что нужно проверять при использовании сканера отпечатка и Face ID?","",
        "assets/voise/1qUs121.mp3"
      ],
      "122": [
        "Как я могу запускать тесты Android без Appium?","",
        "assets/voise/1qUs122.mp3"
      ],
      "123": [ "Объясните концепцию дизайна Appium.","", "assets/voise/1qUs123.mp3" ],
      "124": [
        "Программа производит чтение с трёх целых чисел, которые интерпретируются как длины сторон треугольника. Далее программа выдает сообщение о том, является ли треугольник неравносторонним, равнобедренным или равносторонним.","", "assets/voise/samCh.mp3"
      ],
      "125": [ "Нужно протестировать консольное приложение, которое на вход принимает 3 целых числа, интерпретируемые как длины сторон треугольника, а на выходе выводит на экран является ли введенный треугольник равнобедренным или равносторонним. Предложите конкретные значения тестовых данных, которые Вы будете использовать для тестирования такого приложения ","", "assets/voise/samCh.mp3" ],
      "126": [ "Напишите сценарии автоматического тестирования для сортировки по цене и добавлению товара в корзину на сайте https://www.saucedemo.com/ . К вашим тестам добавьте документацию с настройками и разместите ваше решение на GitHub.","звучит как бесплатная работа на компанию", "assets/voise/samCh.mp3" ],
      "127": [ "Написать чеклист для функционала корзины в интернет-магазине.","", "assets/voise/samCh.mp3" ],
      "128": [
        "Написать тестовые наборы данных для поля ввода даты, которое отсеивает пользователей в возрасте до 18 лет.","", "assets/voise/samCh.mp3"
      ],
      "129": [
        "Написать чеклист тестирования формы ввода данных платежной карты.", "", "assets/voise/1qUs129.mp3"
      ],
      "130": [
        "Протестовать «карандаш» относительно различных видов тестирования. ","Вы сговорились что-ли?! ", "assets/voise/1qUs130.mp3"
      ],
      "131": [
        " Есть Input поле, принимающее целые значения от 18 до 99 включительно. Надо протестировать с помощью техники тест-дизайна Boundary Values ​​Analysis и Equivalence Partitioning.","разбиение на классы 0-18, 18-99, 99- 9999 ", "assets/voise/samCh.mp3"      ],
      "132": [
        "Есть веб-страница с полями: e-mail, password и кнопкой submit. Необходимо привести примеры отрицательных тест-кейсов, которыми можно проверить эту страницу.","удалить из дом дерева ивставить новый инпут тем  самое тем самым убрав проверки повешанные на этом инпуте", "assets/voise/samCh.mp3"
      ],
      "133": [
        " Привести примеры тест-кейсов для функционала, находящегося на нескольких страницах проекта (например, поле поиска).", "","assets/voise/samCh.mp3"
      ],
      "134": [ "Как протестировать процесс оплаты в интернет-магазине?","","assets/voise/1qUs134.mp3" ],
      "135": [ "Как протестировать сломанный тостер?","","assets/voise/1qUs135.mp3" ],
      "136": [ "Объясните для 7-летнего ребенка, что такое база данных.","","assets/voise/1qUs136.mp3" ],
      "137": [
        "Определите необходимое количество функциональных тест-кейсов, чтобы проверить Log in форму.","","assets/voise/1qUs134.mp3"
      ],
      "138": [
        "Есть форма регистрации в веб-приложении с полями (first name, last name, username, password, repeat password) и кнопкой Register. Какие проверки нужно провести?","", "assets/voise/samCh.mp3"
      ],
      "139": [
        "Поле username должно быть обязательным, но оно не является обязательным. Приведите пример баг-репорта, созданного для этой ошибки.","", "assets/voise/samCh.mp3"
      ],
      "140": [ "Как бы вы провели smoke-testing для приложения типа Telegram?" ],
      "141": [
        "Как будет выглядеть баг-репорт, если, к примеру, не работает электрический чайник?"
      ],
      "142": [
        "Есть таблица books с полями: name, price, page_count. Следует выбрать все имена книг, в которых price более 10 единиц и количество страниц от 20 до 100.","", "assets/voise/samCh.mp3"
      ],
      "143": [
        " У вас есть функционал калькулятора, который доступен через веб-браузер по ссылке. Он имеет только функцию делить, так сказать, MVP-версию. Диапазоны для вписывания в числитель и делитель от 0,1 до 99,9. Вывод значения происходит автоматически, потому что front-end реализован на React JS. Как вы будете тестировать этот функционал? Какие виды тестирования примените? Какие техники тест-дизайна используете?", "","assets/voise/samCh.mp3"
      ],
      "144": [ "Задание на работу с SQL на сайте стоит посмотреть Сылка в ответе.","https://tproger.ru/articles/5-zadanij-po-sql-s-realnyh-sobesedovanij/", "assets/voise/samCh.mp3" ],
      "145": [
        " Ваша компания разрабатывает программное обеспечение для медицинских систем, и вы тестируете компонент, управляющий дефибриллятором сердца. Вы заметили, что одно решение в тестовом модуле состоит из 34 независимых атомарных условий. Какой метод тестирования белого ящика следует выбрать для этого и почему?", "","assets/voise/samCh.mp3"
      ]
    },
    {
      "1": [ "Назовите обязанности QA?", " QA-инженер — специалист, который следит за качеством продукта на всех этапах его разработки. _Задачи QA: _ • Анализирует техническую документацию и требования к продукту на этапе проектирования ПО. _ • Разрабатывает сценарии тестирования. _ • Тестирует MVP — Minimum Viable Product — самую примитивную версию продукта, которая уже может привлечь первых пользователей. _ • Создаёт метрики качества ПО. Их можно разделить на два вида: внутренние и внешние. К первым относят свойства продукта, которые видны только команде проекта: метрики размера, сложности и стиля. Внешние — это свойства, видимые пользователям. Здесь выделяют метрики надёжности, функциональности, применимости и стоимости продукта. _ • Фиксирует найденные ошибки. _ • Отслеживает процессы исправления багов и ошибок. _ • Повторно анализирует качество ПО. _ • Проводит мониторинг метрик качества.", "assets/voise/2qUs1.mp3","https://netology.ru/blog/09-2022-who-is-qa#:~:text=QA%2D%D0%B8%D0%BD%D0%B6%D0%B5%D0%BD%D0%B5%D1%80%20%E2%80%94%20%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%2C%20%D0%BA%D0%BE%D1%82%D0%BE%D1%80%D1%8B%D0%B9,%D0%BA%D0%BE%D0%BC%D0%BF%D0%B0%D0%BD%D0%B8%D0%B8%20%D1%8D%D0%BA%D0%BE%D0%BD%D0%BE%D0%BC%D0%B8%D1%82%D1%8C%20%D0%BD%D0%B0%20%D0%B8%D1%85%20%D0%B8%D1%81%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B8." ],
      "2": [
        " Что знаете о тестировании нагрузки? В каком случае следует проводить такое тестирование? На каком этапе готовности продукта?",
        "Тестирование нагрузки — это практика моделирования реального использования или загрузки любого программного обеспечения, веб-сайта, веб-приложения, API или системы для анализа и выявления таких факторов, как отзывчивость, деградация и масштабируемость. После функционального тестирования и при исправлении всех критичнх ошибок в продукте ",
        "assets/voise/2qUs2.mp3"
      ],
      "3": [
        "Что такое Таблица принятия решений (decision table) и как её можно использовать?",
        "В таблицах решений представлен набор условий, одновременное выполнение которых должно привести к определенному действию/решению.",
        "assets/voise/2qUs3.mp3"
      ],
      "4": [
        "Что может быть критериями запуска и завершения тестирования?",
        " Критерии запуска: _ • все дефекты, которые относятся к ранним стадиям проектирования закрыты и проверены;_   • Код проверенный с помощью осуществления «Unit» тестов;_   • Основные функциональные возможности ПО готовы для тестирования;_  • Имеется документация, которая определяет требования;_   • Все тестировщики ознакомлены с архитектурой ПО;_    • Все тестировщики ознакомлены с целями проекта; _   • Готова среда тестирования;_доступные для использования билды;_   • Утверждены план тестирования и/или тестовые случаи. _Критерии завершения: _ • Все исправленные дефекты были протестированы повторно _ •  все запланированные тесты выполнены _ • Больше 80% тестов должны быть пройдены успешно_ • Нет открытых дефектов с критичностью (Severity) Critical _ • Нет открытых дефектов с критичностью (Severity) Major",
        "assets/voise/2qUs4.mp3"
      ],
      "5": [
        " Расскажите о вариантах интегрирования тестовой документации в проект, инструментах для работы с ней.",
        "Есть баг трекинговые системы jira с возможностью устанавливать дополнения в виде zephyr! zephyr - добавляет удобную и рентабельную систему управления тестированием к JIRA созданно  ",
        "assets/voise/2qUs5.mp3"
      ],
      "6": [
        "Как организовать сквозное тестирование (e2e)?",
        "Скзваное тестирование требует подготовки, чем сложнее система чем больше инеграций возоимодейсвтуюших систем тем больше ресурсов нам понадобится этапы организации следю друг за другом самый первый этап это подбор и выделения ресурсов, за ним следует Анализ требоований и оценка трудозатрат! Далее идет один из боьших проецссов это: _ • Подготовка стратегий тестирования. -> согласования команды E2E. -> подготовка плана E2E.  _ • подготовка сипска сценариев. -> подготовка тестовой среды -> разработка и согласование тест-кейсов -> это все вылевается в подгатовку в тестовых данных _ Псоле происходит прием результатов интеграционного и функционального тестирование -> и выполнения E2E ",
        "assets/voise/2qUs6.mp3","https://habr.com/ru/company/mvideo/blog/559542/"
      ],
      "7": [
        "Напишите чек лист для тестирования реляционной базы данных ?",
        "_ 1 Убедиться, что данные, которые отображаются на сайте, - это те же самые данные, что находятся на сервере.,_ 2 Убедиться, что каждый столбец имеет ограничения входных значений (значения, превышающие это ограничение, не должны приниматься). ,_ 3 Убедиться, что в таблицы базы данных можно вводить граничные значения, полученные от клиента.,_ 4 Проверить функциональность хранимых процедур БД (название, параметры, возвращаемые значения, синтаксис и т.д.).,_ 5 Убедиться, что при внесении изменений в БД данные в ней обновляются (создание,  удаление и редактирование записей).,_ 6 Убедиться, что пользователь не узнает о том, что в базе данных какая-либо ошибка (со стороны бекенда).,_ 7 Проверить, что пользователь не может войти в базу данных без аутентификации.,_ 8 Убедиться, что запросы в БД выполняются без каких-либо сбоев. ,_ 9 Проверить, что все таблицы имеют корректный внешний/первичный ключ. ,_ 10 Убедиться, что сервер базы данных может обрабатывать отрицательные числа.,_ 11 Проверить время ответа сервера базы данных.,_ 12 ВСЕ таблицы базы данных должны сопровождаться кратким описанием.,_ 13 Проверить, что структура БД сопровождается спецификацией (таблицы, колонки, хранимые процедуры, индексы, типы данных, флаги и т.д.).,_ 14 Проверить, что изменения, сделанные пользователем, сохраняются только по завершении процесса (если в процессе работы произошел сбой, изменения должны быть проигнорированы).,_ 15 Проверить, что клиент работает с необходимой ему базой данных (в большинстве случаев сайты на бекенде взаимодействуют с несколькими базами данных),_ 16 Убедиться, что клиент не может изменять значения на NULL (в таблицах, в которых стоит запрет на внесения нулевых значений)",
        "assets/voise/2qUs7.mp3","http://losieva.blogspot.com/2016/07/david-tzemach.html"
      ],
      "8": [
        "Приведите примеры подходов для тестирования локализации.",
        "",
        "assets/voise/2qUs8.mp3"
      ],
      "9": [ "Что такое A/B тестирование?", "", "assets/voise/2qUs9.mp3" ],
      "10": [
        "Что такое mock/stub? Какие знаете инструменты для работы с ними?",
        "",
        "assets/voise/2qUs10.mp3"
      ],
      "11": [
        "Когда нужно использовать технику Pairwise?",
        "",
        "assets/voise/2qUs11.mp3"
      ],
      "12": [
        "Что такое fuzz-тестирование и где его используют?",
        "",
        "assets/voise/2qUs12.mp3"
      ],
      "13": [ "Что такое REgexp?", "", "assets/voise/2qUs13.mp3" ],
      "14": [
        "Как меняется стоимость дефекта при тестировании программного обеспечения?",
        "",
        "assets/voise/2qUs14.mp3"
      ],
      "15": [
        "Каковы пути анализа бизнеса клиента? Как определить целесообразность того или иного функционала?",
        "",
        "assets/voise/2qUs15.mp3"
      ],
      "16": [
        "Назовите последовательность выполнения CI/CD процесса на проекте.",
        "",
        "assets/voise/2qUs16.mp3"
      ],
      "17": [
        "Какое должно быть процентное соотношение между положительным и отрицательным тестированием на проекте?",
        "",
        "assets/voise/2qUs17.mp3"
      ],
      "18": [
        "Какой вид тестирования целесообразнее проводить до релиза?",
        "",
        "assets/voise/2qUs18.mp3"
      ],
      "19": [
        "Есть ли разница между bug leakage и bug release?",
        "",
        "assets/voise/2qUs19.mp3"
      ],
      "20": [
        "Может ли быть ситуация, когда критерии завершения (exit criteria) не выполнены? Что должно происходить в этом случае?",
        "Следует выделить 3 основных критерия для остановки: _ • Время — В ходе тестирования могут находиться баги с разным приоритетом серьезности, попадаются баги блокеры, которые блокируют дальнейшее прохождение по тест кейсам, время на исправление и перепроверку багов может затянуться. Так как продукт или новую фитчу обещали к определенной дате то проджект менеджер вместе с тим лидом или тестировщиком принимает решение какие баги все таки стоить исправить, а какие можно отложить до следующего релиза в порядке приоритета и серьезности багов. Таким образом тестирование завершается по истечении времени. _ • Бюджет — очень популярно на биржах фриланса, когда оплачиваются найденные баги в зависимости от количества и серьезности или оплачивается по количеству пройденных тест кейсов, также выделяется бюджет на написание самих тесткейсов. И когда бюджет опустошен, то все работы по тестированию прекращаються. Как и на фриланс бирже заказчик иногда просто оплачивает время работы аутсорсного тестировщика и иногда не вписываясь в бюджет, просматривает написанные тест кейсы и какие-то выкидывает в силу не влезания в бюджет. _ • Все тест кейсы пройдены, найденные баги исправлены и перепроверены — Для того чтобы протестировать приложение, тестировщик для начала должен ознакомиться с требованиями, функциональными спецификациями к приложению, если они конечно есть, или узнать со слов заказчика какое поведение должно быть при разных сценариях использования приложения или фитчи. Затем заняться составлением тестовой документации — написанием тест кейсов, написать тест план если нужно, покрывая весь функционал и требования к приложению. Также обсудить и решить в команде или самостоятельно не требуется ли проводить нефункциональное тестирование, такое как нагрузочное тестирование (Performance and Load Testing), тестирование удобства пользовавия (Usability Testing) и т.д. Так как у каждого приложения есть «узкие места», на которые следует обратить внимание при тестировании. Далее начать выполнять, проходить тест кейсы и в момент, когда все тест кейсы пройдены и найденные баги исправлены и перепроверены, можно завершать тестирование." ,
        "assets/voise/2qUs20.mp3","https://software-testing.org/testing/kriterii-vyhoda-zaversheniya-testirovaniya-exit-criteria-kogda-ostanovitsya-testirovat.html#:~:text=%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B5%D1%82%20%D0%B2%D1%8B%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C%203%20%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D1%8B%D1%85%20%D0%BA%D1%80%D0%B8%D1%82%D0%B5%D1%80%D0%B8%D1%8F,%D0%BD%D0%B0%D0%B9%D0%B4%D0%B5%D0%BD%D0%BD%D1%8B%D0%B5%20%D0%B1%D0%B0%D0%B3%D0%B8%20%D0%B8%D1%81%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D1%8B%20%D0%B8%20%D0%BF%D0%B5%D1%80%D0%B5%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D1%80%D0%B5%D0%BD%D1%8B"
      ],
      "21": [
        "Что мы действительно должны покрывать тест-кейсами, а что считается избыточным расходом времени и денег? Когда нецелесообразно писать тест-кейсы?",
        "",
        "assets/voise/2qUs21.mp3"
      ],
      "22": [
        "Для какого функционала труднее всего написать тест-кейсы?",
        "",
        "assets/voise/2qUs22.mp3"
      ],
      "23": [
        "Как посчитать Cyclomatic complexity?",
        "",
        "assets/voise/2qUs23.mp3"
      ],
      "24": [
        "В чем основная разница между defect detection percentage и defect removal efficiency?",
        "",
        "assets/voise/2qUs24.mp3"
      ],
      "25": [
        "Какие модели risk-based testing вы знаете?",
        "",
        "assets/voise/2qUs25.mp3"
      ],
      "26": [
        "Что такое тестирование API? Какими инструментами пользуются для его выполнения?",
        "",
        "assets/voise/2qUs26.mp3"
      ],
      "27": [
        "Что такое performance testing? Какими инструментами пользуются для его выполнения?",
        "",
        "assets/voise/2qUs27.mp3"
      ],
      "28": [
        "Что такое load и stress testing? Какими инструментами пользуются для их выполнения?",
        "",
        "assets/voise/2qUs28.mp3"
      ],
      "29": [ "Что такое contract testing?", "", "assets/voise/2qUs29.mp3" ],
      "30": [
        "Какая разница между Scrum и Kanban?",
        "",
        "assets/voise/2qUs30.mp3"
      ],
      "31": [
        "Расскажите о ритуалах, ценностях и ролях в Scrum.",
        "",
        "assets/voise/2qUs31.mp3"
      ],
      "32": [
        "Как выбор методологии может повлиять на качество разработки?",
        "",
        "assets/voise/2qUs32.mp3"
      ],
      "33": [
        " Нулевой спринт в Scrum. Для тестирования есть задание под названием Настройка среды. Что здесь нужно выполнять?",
        "",
        "assets/voise/2qUs33.mp3"
      ],
      "34": [
        "Расскажите, как вы будете строить и внедрять стратегию по автоматизации тестирования используя Selenium.",
        "",
        "assets/voise/2qUs34.mp3"
      ],
      "35": [
        "Как взаимодействуют клиентская библиотека Selenium, драйвер браузера и сам браузер?",
        "",
        "assets/voise/2qUs35.mp3"
      ],
      "36": [
        "Для чего используют browser capabilities, arguments и options?",
        "",
        "assets/voise/2qUs36.mp3"
      ],
      "37": [
        "Что такое iframe и как с ним работать в Selenium?",
        "",
        "assets/voise/2qUs37.mp3"
      ],
      "38": [
        "Как обрабатывать браузерные сообщения (alerts)?",
        "",
        "assets/voise/2qUs38.mp3"
      ],
      "39": [ "Что такое Appium?", "", "assets/voise/2qUs39.mp3" ],
      "40": [
        "Что такое Electron-based applications? Как использовать Selenium и Appium для их тестирования?",
        "",
        "assets/voise/2qUs40.mp3"
      ],
      "41": [
        "Как взаимодействовать с запросами, отправляемыми из браузера?",
        "",
        "assets/voise/2qUs41.mp3"
      ],
      "42": [
        "Как взаимодействовать с cookies, LocalStorage и SessionStorage?",
        "",
        "assets/voise/2qUs42.mp3"
      ],
      "43": [
        "Что такое и чем отличаются виртуальная машина, симулятор и эмулятор?",
        "",
        "assets/voise/2qUs43.mp3"
      ],
      "44": [
        "Что такое контейнер и чем он отличается от виртуальной машины?",
        "",
        "assets/voise/2qUs44.mp3"
      ],
      "45": [
        "Как используют виртуальные машины и контейнеры в автоматизации?",
        "",
        "assets/voise/2qUs45.mp3"
      ],
      "46": [
        "​​Что такое IaaS и PaaS? Приведите примеры.",
        "",
        "assets/voise/2qUs46.mp3"
      ],
      "47": [
        "Что такое Configuration Management?",
        "",
        "assets/voise/2qUs47.mp3"
      ],
      "48": [ "Что такое Provisioning?", "", "assets/voise/2qUs48.mp3" ],
      "49": [
        " Какие команды Linux Shell вам известны? Как с помощью команд Linux Shell найти лог-файл и строчку с ошибкой в ​​файле?",
        "",
        "assets/voise/2qUs49.mp3"
      ],
      "50": [
        "Какие команды Windows CMD вам известны? Как с помощью команд Windows CMD найти IP-адрес машины?",
        "",
        "assets/voise/2qUs50.mp3"
      ],
      "51": [
        "Что такое SSH и как им пользоваться?",
        "",
        "assets/voise/2qUs51.mp3"
      ],
      "52": [
        "Что такое bash и batch скрипты? Зачем их используют?",
        "",
        "assets/voise/2qUs52.mp3"
      ],
      "53": [
        "Какая разница между авторизацией и аутентификацией?",
        "",
        "assets/voise/2qUs53.mp3"
      ],
      "54": [
        "Как происходит авторизация на сервере?",
        "",
        "assets/voise/2qUs54.mp3"
      ],
      "55": [
        "Какие статус-коды ошибок бывают? Может ли сервер отправить код 400, если проблема на его стороне?",
        "",
        "assets/voise/2qUs55.mp3"
      ],
      "56": [
        "Как выполнить Debug страницы в браузере?",
        "",
        "assets/voise/2qUs56.mp3"
      ],
      "57": [
        "Как протестировать адаптивную верстку?",
        "",
        "assets/voise/2qUs57.mp3"
      ],
      "58": [
        "Что такое WebSocket и как проверить обрыв соединения?",
        "",
        "assets/voise/2qUs58.mp3"
      ],
      "59": [
        "Каковы есть основные виды уязвимости веб-приложений?",
        "",
        "assets/voise/2qUs59.mp3"
      ],
      "60": [
        "Какие инструменты для тестирования Web performance client-side знаете?",
        "",
        "assets/voise/2qUs60.mp3"
      ],
      "61": [
        "Какова разница между методами GET и POST?",
        "",
        "assets/voise/2qUs61.mp3"
      ],
      "62": [
        "Какая разница между методами PUT и PATCH?",
        "",
        "assets/voise/2qUs62.mp3"
      ],
      "63": [ "Какие знаете сниферы?", "", "assets/voise/2qUs63.mp3" ],
      "64": [
        "Какова разница между DROP и TRUNCATE?",
        "",
        "assets/voise/2qUs64.mp3"
      ],
      "65": [ "Что такое case function?", "", "assets/voise/2qUs65.mp3" ],
      "66": [ "Что такое collation?", "", "assets/voise/2qUs66.mp3" ],
      "67": [ "Что такое схема GraphQL?", "", "assets/voise/2qUs67.mp3" ],
      "68": [
        "Объясните разницу между OLTP и OLAP.",
        "",
        "assets/voise/2qUs68.mp3"
      ],
      "69": [
        "Вспомните разные типы репликации в SQL Server?",
        "",
        "assets/voise/2qUs69.mp3"
      ],
      "70": [
        "Что вы понимаете под Self Join? Приведите примеры.",
        "",
        "assets/voise/2qUs70.mp3"
      ],
      "71": [
        "Что такое cursor и как им пользоваться?",
        "",
        "assets/voise/2qUs71.mp3"
      ],
      "72": [
        "Что основное нужно проверить при тестировании мобильного приложения?",
        "",
        "assets/voise/2qUs72.mp3"
      ],
      "73": [
        "Что такое Manifest.xml в .apk файле и какие данные там указывают?",
        "",
        "assets/voise/2qUs73.mp3"
      ],
      "74": [
        "Что такое режим разработчика Do not keep activities?",
        "",
        "assets/voise/2qUs74.mp3"
      ],
      "75": [
        "Как происходит перехват трафика http/https для мобильных устройств?",
        "",
        "assets/voise/2qUs75.mp3"
      ],
      "76": [
        "В каком виде хранятся данные в мобильных приложениях локально?",
        "",
        "assets/voise/2qUs76.mp3"
      ],
      "77": [
        "Как тестировать миграцию локальных данных?",
        "",
        "assets/voise/2qUs77.mp3"
      ],
      "78": [
        "Каковы основные компоненты Android-приложений (активити / фрагмент / сервис / интент-фильтр)?",
        "",
        "assets/voise/2qUs78.mp3"
      ],
      "79": [
        "Опишите жизненный цикл разработки ПО.",
        "",
        "assets/voise/2qUs79.mp3"
      ],
      "80": [
        "Что такое утечки памяти? Как найти?",
        "",
        "assets/voise/2qUs80.mp3"
      ],
      "81": [
        "Как протестировать билд на Android?",
        "",
        "assets/voise/2qUs81.mp3"
      ],
      "82": [
        "Что такое Testflight? Как тестировать с его помощью?",
        "",
        "assets/voise/2qUs82.mp3"
      ],
      "83": [
        "Как работает Android? Какая у него архитектура?",
        "",
        "assets/voise/2qUs83.mp3"
      ],
      "84": [
        "Как происходит деплой программ IOS/AOS?",
        "",
        "assets/voise/2qUs84.mp3"
      ],
      "85": [
        " Что делать, если разработчик не соглашается, что указанный баг действительно является багом? А если в требованиях использована неоднозначная формулировка? Если бизнес-аналитик, PM и представитель клиента сейчас недоступны, чтобы подсказать? Как можно предотвратить такую ​​ситуацию?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "86": [
        "Сложилась ситуация, когда команда тестирования не успевает закончить свою работу в дедлайн. Как правильно действовать в этом случае? А если релиз передвинуть нельзя? А если никакие фичи из релиза забрать нельзя?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "87": [
        "Что делать, если проект уже начался, а QA-инженер там начал работать только когда начали разрабатываться бизнес-фичи? Какие этапы тестирования теперь нужно наверстать и нужно ли это? Как это сделать максимально грамотно без ущерба для загрузки по тестированию новых фич? Какие риски имеет позднее вовлечение QA-инженера в разработку?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "88": [
        "Веб-страница с полями e-mail, password и кнопкой submit. Назовите отрицательные тест-кейсы, по которым можно проверить эту страницу.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "89": [
        " Предположим, что после нажатия кнопки submit страница перезагружается и ранее введенные данные исчезают. Как проверить, что информация отправлена ​​в базу данных?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "90": [
        "Как проверить, что данные отправились на сервер, если у нас нет доступа к бэкенду?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "91": [
        "Приведите примеры улучшений для приведенной веб-страницы (любая на выбор).",
        "",
        "assets/voise/samCh.mp3"
      ],
      "92": [
        "Составить Smoke Test Suite для DOU.ua.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "93": [
        "Протестовать функционал банкомата с помощью техники State Transition Diagram.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "94": [
        "Написать предельные значения для ввода в форму оплаты товара на сайте.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "95": [
        "Есть метод POST, который регистрирует нового пользователя на сайте, есть тело запроса, содержащее данные о почте, телефоне, имени пользователя и адресе проживания. Какие кейсы для проверки можете привести?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "96": [
        "На что следует акцентировать внимание при автоматизации методов API? Что следует проверять?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "97": [
        "Вы тестируете логин-форму, вводите логин и пароль, нажимаете кнопку логин и ничего не происходит. Ваши действия?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "98": [
        "Что такое Тестовое Покрытие (Test Coverage)",
        "это одна из метрик оценки качества тестирования, представляющая из себя плотность покрытия тестами требований либо исполняемого кода.",
        "http://www.protesting.ru/testing/testcoverage.html",
        "",
        "assets/voise/samCh.mp3"
      ],
      "99": [
        "Вам нужно сделать Regression Testing за два дня. Как вы это сделаете, если Regression Run охватывает 1000 тест-кейсов?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "100": [
        "Вы тестируете интернет-магазин, который продаёт карандаши. В заказе нужно указать количество карандашей (максимум для заказа – 1000 штук). В зависимости от заказанного количества карандашей отличается цена: _1–100 – 10 грн за шт. _101-200 – 9 грн за шт. _201-300 – 8 грн за шт. _С каждой новой сотней цена уменьшается на 1 гривну. Задание: используя тест-дизайн, опишите все необходимые тест-кейсы, которые будут максимально покрывать описанную функциональность.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "101": [
        "Есть приложение типа мессенджера, пользователь заходит в чат и отсылает файл (видит сообщение Failed to send...) Когда это может быть баг, а когда нет?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "102": [
        "Есть веб-приложение интернет-магазина (регистрация, логин, поиск товаров, корзина и покупки). Программу поддерживают следующие браузеры: Chrome, Safari, Edge. У нас есть ограниченное время на тестирование. Расскажите, как вы будете проверять приложение?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "103": [
        "Напишите автоматические тестовые сценарии для проверки API операций создания и просмотра GitHub Gists. Интегрируйте ваш проект с известной вам CI-системой.",
        "",
        "assets/voise/samCh.mp3"
      ]
    },
    {
      "1": [
        "Как вы преодолеете трудности из-за отсутствия надлежащей документации для тестирования?",
        "",
        "assets/voise/3qUs1.mp3"
      ],
      "2": [
        "Какой подход является наилучшим для старта QA в проекте?",
        "",
        "assets/voise/3qUs2.mp3"
      ],
      "3": [
        "Какие препятствия могут возникнуть в обеспечении качества для Agile Tester?",
        "",
        "assets/voise/3qUs3.mp3"
      ],
      "4": [ "Что такое Definition of Done?", "", "assets/voise/3qUs4.mp3" ],
      "5": [
        "Когда можно считать, что тестирование окончено?",
        "",
        "assets/voise/3qUs5.mp3"
      ],
      "6": [
        "Что такое RCA в тестировании? Нужно ли его проводить?",
        "",
        "assets/voise/3qUs6.mp3"
      ],
      "7": [
        "Какой подход вы используете для Test Cases Review?",
        "",
        "assets/voise/3qUs7.mp3"
      ],
      "8": [
        "Какие виды рисков существуют? Что такое Mitigation Plan?",
        "",
        "assets/voise/3qUs8.mp3"
      ],
      "9": [
        "На основе чего нужно составлять стратегию для проведения тестирования нагрузки?",
        "",
        "assets/voise/3qUs9.mp3"
      ],
      "10": [
        "Как часто следует ревьюировать тестовую документацию?",
        "",
        "assets/voise/3qUs10.mp3"
      ],
      "11": [
        "Как можно быстро сделать выборку необходимых проверок для смоук-тестирования?",
        "",
        "assets/voise/3qUs11.mp3"
      ],
      "12": [
        "Как запланировать загруженность команды тестировщиков?",
        "",
        "assets/voise/3qUs12.mp3"
      ],
      "13": [
        "Какую ценность несет анализ результатов тестирования команде и проекту в целом?",
        "",
        "assets/voise/3qUs13.mp3"
      ],
      "14": [
        "Как можно подкорректировать флоу разработки, чтобы получать более чистые результаты на выходе и уменьшить количество багов на проде?",
        "",
        "assets/voise/3qUs14.mp3"
      ],
      "15": [
        "Расскажите о метриках качества, которые вы применяли. Зачем они нужны?",
        "",
        "assets/voise/3qUs15.mp3"
      ],
      "16": [
        "Как провести эстимейт задачи? Каковы техники оценки объема тестирования существуют?",
        "",
        "assets/voise/3qUs16.mp3"
      ],
      "17": [
        "Как можно посчитать покрытие тестами функционала?",
        "",
        "assets/voise/3qUs17.mp3"
      ],
      "18": [
        "Какое оптимальное количество шагов в тестовом сценарии?",
        "",
        "assets/voise/3qUs18.mp3"
      ],
      "19": [
        "Как избежать появления регрессивных дефектов?",
        "",
        "assets/voise/3qUs19.mp3"
      ],
      "20": [
        "Что такое тестирование со смещением влево (Shift left testing)?",
        "",
        "assets/voise/3qUs20.mp3"
      ],
      "21": [
        "Как будете тестировать программу, если для продукта нет документации?",
        "",
        "assets/voise/3qUs21.mp3"
      ],
      "22": [ "В чем смысл юнит-тестов?", "", "assets/voise/3qUs22.mp3" ],
      "23": [
        "Какие минусы полной автоматизации тестирования?",
        "",
        "assets/voise/3qUs23.mp3"
      ],
      "24": [ "Что такое ROI и как его считать?", "", "assets/voise/3qUs24.mp3" ],
      "25": [
        "Что такое CI/CD? Какие плюсы и минусы этого подхода?",
        "",
        "assets/voise/3qUs25.mp3"
      ],
      "26": [
        "TOP OWASP: какие знаете уязвимости и методы защиты?",
        "",
        "assets/voise/3qUs26.mp3"
      ],
      "27": [
        "Что вы думаете по поводу BDD? Когда следует использовать, а когда будет только хуже? Если все же следует использовать, то для UI или API автоматизированного тестирования?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "28": [
        "Что такое сокеты и как их тестировать, вручную и автоматизировано? Зачем их используют?",
        "",
        "assets/voise/3qUs28.mp3"
      ],
      "29": [
        "Когда следует делать стресс-тестирование на проектах? От чего отталкиваться, когда строите сценарий для такого тестирования? Что учесть при выборе инструмента?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "30": [
        "Как проверить безопасность на веб-странице?",
        "",
        "assets/voise/3qUs30.mp3"
      ],
      "31": [
        "Расскажите об алгоритмах шифрования трафика.",
        "",
        "assets/voise/3qUs31.mp3"
      ],
      "32": [ "Что такое NIC?", "", "assets/voise/3qUs32.mp3" ],
      "33": [ "Для чего нужен протокол RTP?", "", "assets/voise/3qUs33.mp3" ],
      "34": [
        "Что, по вашему мнению, лучше – SIP или PRI?",
        "",
        "assets/voise/3qUs34.mp3"
      ],
      "35": [ "Что такое NAT?", "", "assets/voise/3qUs35.mp3" ],
      "36": [
        "Зачем нужно автоматизировать?  назовите плюсы и минусы автоматизации",
        "Главная цель внедрения автоматизации бизнеса в работу компании – оптимизация деятельности, помогает свести к минимуму рутинные задачи. Это особенно важно для процессов, которые непосредственно влияют на достижение результата. Минимизирует человеческий фактор. Иногда ошибки, вызванные человеческим фактором, могут дорого стоить. _  Повторяемость – все написанные тесты всегда будут выполняться однообразно, то есть исключен «человеческий фактор» _  Преимущества автоматизации тестирования:_ _  Быстрое выполнение – автоматизированному скрипту не нужно сверяться с инструкциями и документациями, это сильно экономит время выполнения. _  Меньшие затраты на поддержку – когда автоматические скрипты уже написаны, на их поддержку и анализ результатов требуется, как правило, меньшее время чем на проведение того же объема тестирования вручную. _  Отчеты – автоматически рассылаемые и сохраняемые отчеты о результатах тестирования. _  Выполнение без вмешательства – во время выполнения тестов инженер-тестировщик может заниматься другими полезными делами, или тесты могут выполняться в нерабочее время (этот метод предпочтительнее, так как нагрузка на локальные сети ночью снижена). _   Недостатки автоматизации_ Повторяемость – все написанные тесты всегда будут выполняться однообразно. Это одновременно является и недостатком, так как тестировщик, выполняя тест вручную, может обратить внимание на некоторые детали и, проведя несколько дополнительных операций, найти дефект. Скрипт этого сделать не может. _Затраты на поддержку – несмотря на то, что в случае автоматизированных тестов они меньше, чем затраты на ручное тестирование того же функционала – они все же есть. Чем чаще изменяется приложение, тем они выше. _ Большие затраты на разработку – разработка автоматизированных тестов это сложный процесс, так как фактически идет разработка приложения, которое тестирует другое приложение. _ Стоимость инструмента для автоматизации – в случае если используется лицензионное ПО, его стоимость может быть достаточно высока. _ Пропуск мелких ошибок - автоматический скрипт может пропускать мелкие ошибки на проверку которых он не запрограммирован. Это могут быть неточности в позиционировании окон, ошибки в надписях, которые не проверяются, ошибки контролов и форм с которыми не осуществляется взаимодействие во время выполнения скрипта. ",
        "assets/voise/3qUs36.mp3"
      ],
      "37": [
        "Сформулируйте негативные сценарии для POST-запроса, который создаёт нового пользователя.",
        "",
        "assets/voise/3qUs37.mp3"
      ],
      "38": [
        "Как вы регулируете конфликтные ситуации между QA и разработчиками?",
        "",
        "assets/voise/3qUs38.mp3"
      ],
      "39": [
        "Какое минимальное количество тест-кейсов необходимо, чтобы убедиться в корректной работе этой(на которой ты находишься) веб-страницы?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "40": [
        " Продайте мне тестирование как клиенту, не желающему его покупать. Кратко и структурированно опишите вашу работу на каждом из этапов разработки ПО, используя профессиональные термины (не лить воду).",
        "",
        "assets/voise/samCh.mp3"
      ],
      "41": [
        "У вас есть онлайн-калькулятор. Вы вводите 1+1 и получаете 3. Расскажите, как вы будете искать причину проблемы.",
        "",
        "assets/voise/samCh.mp3"
      ],
      "42": [
        "Могут ли быть такие виды архитектур? Клиент -> сервер -> База данных  Чего может быть недостаточно для правильной работы архитектур?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "43": [
        "Есть веб-страница с полями e-mail, password и кнопкой submit. Предположим, что после нажатия кнопки submit страница перезагружается и ранее введенные данные исчезают. Как проверить, что данные отправлены в базу данных?",
        "",
        "assets/voise/samCh.mp3"
      ],
      "44": [
        "Есть проект, на котором нет тестовой документации, но проекту уже год. Мануальным QA не хватает времени на тестирование, они очень устали, есть желание уволиться. Какое решение по команде можно принять? ",
        "",
        "assets/voise/samCh.mp3"
      ]
    }
  ]
}
